
{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "opinion on prma",
    "home_page_url": "https://prma.dev/tags/opinion/",
    "feed_url": "https://prma.dev/tags/opinion/feed.json",
    "authors": [{
        "name": {"email":"prma.dev@protonmail.com","name":"Perma"},
    }],
    "items": [ {
            "title": "The Tragedy of The Tech-Stacks",
            "id": "https://prma.dev/posts/tragedy_of_the_tech_stacks/",
            "url": "https://prma.dev/posts/tragedy_of_the_tech_stacks/",
            "summary": "Intro Back in 1958, there was this thinker named Garrett Hardin who kicked off his well-known piece titled \u0026ldquo;The Tragedy of the Commons\u0026rdquo; in the following way:\nAt the end of a thoughtful article on the future of nuclear war, Weisner and York concluded that \u0026ldquo;Both sides of the arms race are \u0026hellip; confronted by the dillema of steadily increasing military power and steadily decreasing natonal security. It is our considered our professional judgment that this delimma has not professional technical solution.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eBack in 1958, there was this thinker named  \u003ca href=\"https://en.wikipedia.org/wiki/Garrett_Hardin\" class=\"person p-name\"\u003eGarrett Hardin\u003c/a\u003e     \n who kicked off his well-known piece titled \u0026ldquo;The Tragedy of the Commons\u0026rdquo; in the following way:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eAt the end of a thoughtful article on the future of nuclear war, Weisner and York concluded that \u0026ldquo;Both sides of the arms race are \u0026hellip; confronted by the dillema of steadily increasing military power and steadily decreasing natonal security. It is our considered our professional judgment that this delimma has not professional technical solution. If the great powers continue to look for solutions in the area of science and technology only, the result will be to worsen the situation.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThen,    \n goes on to rattle the foundations by delving into a colossal issue - the challenge of population expansion. He breaks it down by saying that when you have a shared resource, and each individual aims to squeeze out the most benefit for themselves, the result is a harm inflicted upon everyone, even the very ones taking those actions.\u003c/p\u003e\n\u003cp\u003eNow, picture this famous analogy. Imagine a stretch of grassland, claimed by three farmers. Each of them brings their cow out to graze on it daily. Sounds reasonable, right? But then, one fortunate farmer\u0026rsquo;s cow becomes pregnant. This stroke of luck leaves him with two cows, effectively doubling his profits. Observing this triumph, the other farmers follow suit, diving into a spree of buying and breeding cows, aiming to maximize their individual gains. However, this frenzy leads to a rampant grazing that leaves the grassland bare and barren. Ultimately, the once lush grass disappears, and the insatiable appetite of the voracious cows brings about their own starvation. In the end, all the farmers are left with no cows, their initial wealth transformed into a state even worse than before.\u003c/p\u003e\n\u003cp\u003eHe coins it as the \u0026ldquo;tragedy of the commons.\u0026rdquo; I prefer to see it as a powerful representation of what often dampens the enjoyment across the software terrain for every key player involved: the user, the developer, the \u003cabbr title=\"Chief Executive Officer\"\u003eCEO\u003c/abbr\u003e\n, and the investor.\u003c/p\u003e\n\u003cp\u003eHow meta!\u003c/p\u003e\n\u003ch2 id=\"the-clever-one-the-frustrated-one-and-the-scared-one\"\u003eThe Clever One, The Frustrated One and The Scared One\u003c/h2\u003e\n\u003cp\u003eNow, let\u0026rsquo;s meet a familiar figure, the one we often encounter, the embodiment of many developers out there. We\u0026rsquo;ll give her a name: Sarah. Sarah\u0026rsquo;s eager to dive into a fresh technology - one that could potentially elevate her current position. So, how does she tackle this? She begins by exploring a domain, and within that, she sets her sights on a specific technology. Let\u0026rsquo;s designate this domain as something imaginary, to prevent any inadvertent offense. How about we refer to it as \u0026ldquo;Front-End Development\u0026rdquo;?\u003c/p\u003e\n\u003cp\u003eFor Front-End Sarah finds out a few different contenders in the field. She asks herself, what could the industry be thirsty for? The naive answer she arrives at, is \u0026ldquo;the most reliable one, the one that is the pleasure to develop and the one that has the most advantages\u0026rdquo;. Oh, Sarah, you impractical idealistic perfectionist, you!\u003c/p\u003e\n\u003cp\u003eNow, delving into the realm of Front-End, Sarah stumbles upon a handful of potential contenders. She ponders, what might the industry truly crave? Her initial, somewhat naive response is, \u0026ldquo;The most dependable option, the one that brings joy to the development process, and the one that boasts numerous advantages.\u0026rdquo; Oh Sarah, you, impractical, idealistic, perfectionist you!\u003c/p\u003e\n\u003cp\u003eArmed with these benchmarks, she opts for the \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n language (yet another mythical being). She proceeds to dive into \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n, driven by her enthusiasm. However, curiosity gets the better of her, and she sneakily glances at the job listings on LinkedIn. To her astonishment, she discovers a mere trio of job opportunities for \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n. This baffles her, leading her to question the accuracy of her initial language assessment.\u003c/p\u003e\n\u003cp\u003eSeeking insight, she turns to Tom, an exceptional \n she\u0026rsquo;s acquainted with, to discuss whether \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n lives up to its hype. Much to Sarah\u0026rsquo;s astonishment, Tom echoes her initial convictions regarding \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n. He affirms that, indeed, \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n proves to be an exceptional language, boasting enduring dependability, a well-established ecosystem, and a delightful development journey.\u003c/p\u003e\n\u003cp\u003eSarah, now even more puzzled than before, directs her confusion towards Tom, questioning whether he\u0026rsquo;s in the process of recruiting \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n developers. Once again, Tom\u0026rsquo;s response is resolute: \u0026ldquo;Absolutely not! Where could I possibly locate a pool of \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n-savvy developers? However, we\u0026rsquo;re actively seeking out \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n experts!\u0026rdquo; (once more, a language name sufficiently distanced from any existing real-world instances).\u003c/p\u003e\n\u003cp\u003eAfter a brief moment of contemplation, Sarah bursts out, \u003cq cite=\"sarah\"\u003e What about me?\u003c/q\u003e\u003c/p\u003e\n\u003cp\u003eTom responds with a shake of his head, stating, \u0026ldquo;Oh, that wouldn\u0026rsquo;t work. You see, for any given application, we require a team of 20 individuals to consistently handle maintenance and bug fixes. Where on earth would we come across 20 \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n developers?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, shouldn\u0026rsquo;t \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n apps theoretically require significantly less maintenance, given the multitude of bugs that are caught during the initial development stages?\u0026rdquo; Sarah counters silently within her mind. An idea begins to form, one she opts to keep to herself, \u0026ldquo;Ah, so maintaining a delicate codebase might indicate a higher demand for fresh \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n developers - implying enhanced job security!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eFeeling rather clever, she decides to validate her hunch by perusing the (imaginary) yellow pages, named Glassdoor. And lo and behold, an endless scroll unveils a plethora of distinct job listings, all centered around \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n.\u003c/p\u003e\n\u003cp\u003eWell, Sarah learns \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n and all her beliefs gets validated, she becomes a very wealthy engineer, with a great job security, with each company she enters trying to keep her, year-after-yer, while other companies trying to persuade her by higher and higher offers. Or at least that was the boring version of this post that did not start with the word \u0026ldquo;tragedy\u0026rdquo;.\u003c/p\u003e\n\u003cp\u003eInstead, she uncovers that her counterparts, much like herself, had also been quite \u003cem\u003eclever\u003c/em\u003e. A multitude of newcomers gravitated towards the language flaunting the highest job listings. Each job opening faced a surplus of around a hundred contenders. The \u0026ldquo;victor,\u0026rdquo; so to speak, emerges as the individual boasting the most qualifications and the most modest salary expectation. Or should we even label them as victors, considering that the instant they dare to dream a little bigger, a fresh job listing crops up, promptly displacing them with the next eager contender.\u003c/p\u003e\n\u003cp\u003eTom, our trusty \n, worn out from the cycle of on-boarding one low-budget, novice developer after another, vents his frustrations to the \n. The \n engages in discussions with the investors, who share the same dissatisfaction due to their profits being eroded by an inefficient workforce. They call upon the \n to devise a remedy for this predicament.\u003c/p\u003e\n\u003cp\u003eThe \n returns with a strategy to shift from \n to \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n technology. The investors, content with the proposal, take a brief pause to deliberate. A few days later, they rejoin the conversation, expressing a notable apprehension. \u0026ldquo;\u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n is practically unheard of! None of our rivals employ this language. That\u0026rsquo;s a substantial gamble we\u0026rsquo;re not prepared to take!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eArash, the \u003cabbr title=\"Chief Executive Officer\"\u003eCEO\u003c/abbr\u003e\n, \u003cabbr title=\"Chief Technology Officer\"\u003eCTO\u003c/abbr\u003e\n, \u003cabbr title=\"Chief Financial Officer\"\u003eCFO\u003c/abbr\u003e\n, Product Manager, and the visionary founder of a fledgling startup, confronts the very same imaginative quandary of selecting a technology stack. Given the inherent high-stakes nature of startups, Arash adopts a prudent approach by examining the practices of more established corporations, such as those overseen by individuals like Tom in his role as \u003cabbr title=\"Chief Technology Officer\"\u003eCTO\u003c/abbr\u003e\n, in order to identify a tried-and-true trajectory.\u003c/p\u003e\n\u003ch2 id=\"the-lose-lose-lose-situation\"\u003eThe Lose-Lose-Lose situation\u003c/h2\u003e\n\u003cp\u003eAt every juncture, every individual optimized their decisions for personal gain. At each instance, a superior option was presented, and they acknowledged the benefits it offered. Nevertheless, they settled for the inferior alternative (for the sake of avoiding any unnecessary debate, let\u0026rsquo;s refrain from mentioning that the hypothetical lesser choice was \u003cabbr title=\"Sorry I have not defined this abbreviation. Can you please report this to me with my email?\"\u003eJavaScript\u003c/abbr\u003e\n, naturally). As a result, each person finds themselves in a less advantageous position than if they had collectively embraced the superior alternative. This impact ripples beyond individuals, extending to the entire ecosystem, hindered by the precarious edifice of abstractions left behind by the swiftly growing number of predecessors.\u003c/p\u003e\n\u003cp\u003eSo, why did they all fall short of enhancing their own lives and the lives of others? Was it the technology\u0026rsquo;s flaw? Or did the ecosystem falter? You\u0026rsquo;re astute enough to deduce the answer; after all, you had the wit to discern the languages I implicitly referred to in my hypothetical scenarios.\u003c/p\u003e\n\u003ch2 id=\"the-solution\"\u003eThe Solution\u003c/h2\u003e\n\u003cp\u003eI must admit, I\u0026rsquo;m uncertain. The nuclear arsenal continues to expand, even though the era of the Cold War has long passed. Thankfully, our world hasn\u0026rsquo;t been ravaged by nuclear conflict. Rather, it\u0026rsquo;s the interplay of mutually assured destruction and the realization by the leaders of those two nations that not embracing an alternative risk could lead to dire consequences. This, at least, has placed us in a relatively improved state.\u003c/p\u003e\n\u003cp\u003eSimultaneously, we find ourselves grappling with  \u003ca href=\"https://en.wikipedia.org/wiki/Garrett_Hardin\" class=\"person p-name\"\u003eGarrett Hardin\u003c/a\u003e     \n\u0026rsquo;s preoccupation \u0026ndash; the persistent challenges of overpopulation and looming environmental catastrophes. Evidently, the far-reaching peril of not embracing an alternative is of such extended duration that it transcends the immediate concerns of the very generation opting against alternatives. The burden of their choices is instead borne by their descendants: \u003cq cite=\"Current Generation\"\u003eFuck those brats.\u003c/q\u003e\u003c/p\u003e\n\u003cp\u003eIn the world of software, the tempo is notably faster, the stakes less dire compared to earlier circumstances, and the individuals engaged are often more honest than politicians and notably smarter than the average voter.\u003c/p\u003e\n\u003cp\u003eHowever, the remedy doesn\u0026rsquo;t entail adhering to an oddly precise series\nof ritualistic maneuvers. It\u0026rsquo;s a more daunting challenge. Just as\n \u003ca href=\"https://en.wikipedia.org/wiki/Garrett_Hardin\" class=\"person p-name\"\u003eGarrett Hardin\u003c/a\u003e     \n titled his article, the solution remains much the same:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThe population problem has no technical solution; it requires a fundamental extension of in morality.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eI know! The gastly claim of \u003cq cite=\"me\"\u003eto improve developer experience we first should grow an ethical sense\u003c/q\u003e, seems absurd. Yet I see no specifically little amount of gradual change, where at least some one on the whole chain did not bite the bullet and risk it.\u003c/p\u003e\n",
            "date_published": "2023-08-11T12:38:00+03:30"
        }, {
            "title": "Dishonesty of Optimizing for Developer Time",
            "id": "https://prma.dev/posts/dishonesty_of_optimizing_for_developers_time/",
            "url": "https://prma.dev/posts/dishonesty_of_optimizing_for_developers_time/",
            "summary": "Intro Based on some individuals\u0026rsquo; viewpoints, they emphasize optimizing for developer time or productivity as their main priority, rather than giving top precedence to aspects such as performance, robustness, or correctness.\nThe Thesis Their argument revolves around the idea that developers\u0026rsquo; time is more valuable and expensive than server resources. They often use phrases like \u0026ldquo;You can always refactor,\u0026rdquo; \u0026ldquo;You can always optimize for performance,\u0026rdquo; or \u0026ldquo;We will fix bugs later on\u0026rdquo; to support their viewpoint.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eBased on some individuals\u0026rsquo; viewpoints, they emphasize optimizing for developer time or productivity as their main priority, rather than giving top precedence to aspects such as performance, robustness, or correctness.\u003c/p\u003e\n\u003ch2 id=\"the-thesis\"\u003eThe Thesis\u003c/h2\u003e\n\u003cp\u003eTheir argument revolves around the idea that developers\u0026rsquo; time is more valuable and expensive than server resources. They often use phrases like \u0026ldquo;You can always refactor,\u0026rdquo; \u0026ldquo;You can always optimize for performance,\u0026rdquo; or \u0026ldquo;We will fix bugs later on\u0026rdquo; to support their viewpoint. While this perspective may be considered ingenious, it is contingent on proper planning, weighing the trade-offs, and actually acting upon those decisions.\u003c/p\u003e\n\u003ch2 id=\"my-antithesis\"\u003eMy Antithesis\u003c/h2\u003e\n\u003cp\u003eHowever, if this were genuinely the case, more substantial effort would have been invested in refactoring or choosing a more rigorous language than \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n, for example, a language that can significantly boost performance in the long run.\u003c/p\u003e\n\u003cp\u003eFixing bugs in backends written in \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n, \u003cabbr class=\"language\" title=\"PHP: Hypertext Preprocessor\"\u003e\u003ca href=\"https://www.php.net/\"\u003ePHP\u003c/a\u003e\u003c/abbr\u003e\n, or \u003ca class=\"language\" href=\"https://www.python.org/\"\u003ePython\u003c/a\u003e\n is certainly feasible, but adding performance improvements can become challenging, if not improbable. More meticulous programming tools automate the process of finding and fixing even the most elusive bugs and come with significant performance optimizations. The ability to make well-founded assumptions about the program allows for better optimization.\u003c/p\u003e\n\u003cp\u003eThis approach often leads to a situation where future engineers, tasked with rewriting the \u003cabbr title=\"Minimum Viable Product\"\u003eMVP\u003c/abbr\u003e\n program in a more scalable language, face an archeological rediscovery process.\u003c/p\u003e\n\u003cp\u003eSo, if they are not genuinely optimizing for shorter development time, what are they doing?\u003c/p\u003e\n\u003ch2 id=\"lifting-the-veil-the-actual-thesis\"\u003eLifting The Veil: The Actual Thesis\u003c/h2\u003e\n\u003cp\u003eIt appears that they prioritize short-term gains over achieving greater long-term goals.\u003c/p\u003e\n\u003cp\u003eA language like \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n, while providing benefits like enhanced safety and reliability, requires significantly more time to produce a binary or \u003cabbr title=\"Application Programming Interface\"\u003eAPI\u003c/abbr\u003e\ns. The manual labor of finding bugs is taken over by the compiler and the language\u0026rsquo;s semantics. If the focus is on developer productivity, then this automation is naturally desirable. However, what one truly desires to convey is \u0026ldquo;I have this feature, even though it may have some bugs and performance issues, I have it nonetheless.\u0026rdquo;\u003c/p\u003e\n\u003ch2 id=\"the-synthesis\"\u003eThe Synthesis\u003c/h2\u003e\n\u003cp\u003eThat may be a positively good idea for trying the market to see if there is any for that specific idea, for most software developements though, the actual intention is not experimentation, as the novelty of product and bussiness plan do not warrant a need for experimentaion. rather, having something to sell, as fast as possible. That\u0026rsquo;s for start ups. Where there is both legitimate and illegitimate short-termism. But more established enterprises may have this pairing as well. While there are A/B experimentaions going on, trying different approaches to see which works, middle management might also like the addition of another achievement in their yearly reports.\u003c/p\u003e\n\u003cp\u003eA rapid way to discern whether it falls under the category of experimentation/prototyping or an \u003cabbr title=\"Minimum Viable Product\"\u003eMVP\u003c/abbr\u003e\n/achievement-oriented project is to examine whether there is a notably extended period allocated for the program\u0026rsquo;s rewrite compared to its initial development phase.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eSimilar to many phenomena, short-termism can indeed have legitimate applications. The reluctance of many to embrace this term is rooted in its improper and illegitimate uses.\u003c/p\u003e\n\u003cp\u003eCertainly, there are well-intentioned individuals who advocate for developer productivity. However, those with ample experience will acknowledge that long-term developer productivity is not synonymous with low-overhead development, and, more often than not, these two objectives are incompatible.\u003c/p\u003e\n",
            "date_published": "2023-07-31T12:24:00+03:30"
        }, {
            "title": "Criteria For Choosing Tools",
            "id": "https://prma.dev/posts/criteria-for-choosing-tools/",
            "url": "https://prma.dev/posts/criteria-for-choosing-tools/",
            "summary": "Intro The web is utterly fucked. But anyone with some resources resources at hand and curiosity at heart and intentional tool selection can have a decent experience.\nThe Reasons The web\u0026rsquo;s lamentable state can be attributed to several factors. Allow me to enumerate them concisely for clarity:\nBloated beyond reason. Plagued with incessant ads. Prioritizing feature over bug fixes, if addressed at all. Designed to cater to journalists and advertisers, neglecting your needs.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eThe web is utterly fucked. But anyone with some resources resources at hand and curiosity at heart and intentional tool selection can have a decent experience.\u003c/p\u003e\n\u003ch2 id=\"the-reasons\"\u003eThe Reasons\u003c/h2\u003e\n\u003cp\u003eThe web\u0026rsquo;s lamentable state can be attributed to several factors. Allow me to enumerate them concisely for clarity:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBloated beyond reason.\u003c/li\u003e\n\u003cli\u003ePlagued with incessant ads.\u003c/li\u003e\n\u003cli\u003ePrioritizing feature over bug fixes, if addressed at all.\u003c/li\u003e\n\u003cli\u003eDesigned to cater to journalists and advertisers, neglecting your needs.\u003c/li\u003e\n\u003cli\u003eImposing confinement and isolation upon you.\u003c/li\u003e\n\u003cli\u003eFailing to empower users like yourself.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3 id=\"a-brief-digression\"\u003eA Brief Digression\u003c/h3\u003e\n\u003cp\u003eThe final point warrants further elaboration.\u003c/p\u003e\n\u003cp\u003eThe internet is, in fact, a tool. It is \u003cem\u003esomething\u003c/em\u003e that is made to help \u003cem\u003esomeone\u003c/em\u003e achieve \u003cem\u003esome goal\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThe captivating world of \u003cem\u003eWeb 2.0\u003c/em\u003e and \u003cem\u003eSocial Media\u003c/em\u003e (the somethings) - initially promising to empower people (the someones), granting them enriched social connections (the some goal). A promising start, indeed, leaving many with pleasant experiences during the inception of Web 2.0.\u003c/p\u003e\n\u003cp\u003eBut, alas, as time went by, the very incentives that drove these Social Media companies veered them off their intended course. They embarked on a divergent path, straying from their professed mission, and now, Web 2.0 primarily serves as a platform to amplify the voices of journalists and celebrities (the actual someones), propelling them towards greater fame and recognition (the actual some goals).\u003c/p\u003e\n\u003cp\u003eThe driving force behind these shifts? The ever-persistent quest for revenue from advertisers, pushing them to create content that captures maximum engagement. The more captivating, the more lucrative.\u003c/p\u003e\n\u003cp\u003eRegrettably, the landscape has birthed what I would call the \u0026ldquo;four horsemen of reactionary engagement\u0026rdquo;: the doomsday, super political reporter; the enraging, populist racist politician; the trolling, impulsive \u003cabbr title=\"Chief Executive Officer\"\u003eCEO\u003c/abbr\u003e\n; and the drama-driven, vacuous celebrity.\u003c/p\u003e\n\u003cp\u003eIn a nutshell, it appears you\u0026rsquo;ve been played for a fool. Social media\u0026rsquo;s purported aim of empowering you is nothing but a delusion.\u003c/p\u003e\n\u003ch2 id=\"go-empower-yourself\"\u003eGo Empower yourself\u003c/h2\u003e\n\u003cp\u003eBefore you proceed, there\u0026rsquo;s a prerequisite to address: overcoming the fear of missing out. Now, how one achieves this is not within my scope to divulge, but I can assist you in understanding why these fears are unfounded.\u003c/p\u003e\n\u003cp\u003eConsider this: Have you truly missed out on anything of genuine importance? Reflect on whether the latest controversial statement from Donald Trump has genuinely altered the course of your life. And if it did, was Twitter (or whatever they dub it these days) truly the sole or optimal medium for receiving such information?\u003c/p\u003e\n\u003cp\u003eEven in Iran, where official channels are notorious for propagating falsehoods, Twitter appears to be excessive. For me, friends and private messages reliably convey essential information. And indeed, individuals might spend considerable time on Twitter, but isn\u0026rsquo;t the fundamental pledge of social media the relay of information? If that need is already being fulfilled through other means, what purpose does Twitter truly serve?\u003c/p\u003e\n\u003cp\u003eIf you find yourself fortunate enough to reside in a country with trustworthy official channels, and your well-being hinges on crucial information like hurricane alerts, rest assured that dedicated services cater specifically to such needs. Similarly, if you derive pleasure from reading news articles, I suggest identifying the authors whose work you value and following them directly. However, if these activities do not align with your interests, then quite frankly, you have no real necessity for engaging with this \u0026ldquo;stuff.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eOh, my friend, let me share with you a sobering truth about these companies - they\u0026rsquo;re akin to emotionally abusive partners, manipulating you into believing you\u0026rsquo;re nothing without them. They demean you, calling you stupid and incapable of managing your life without their presence. They cunningly weave a narrative of how your life is all thanks to them, that your friendships exist solely because of their benevolence.\u003c/p\u003e\n\u003cp\u003eBut don\u0026rsquo;t be fooled by their deceiving ways. They mangle your interactions, force-feeding you ads and utter nonsense, all while claiming it\u0026rsquo;s an act of love. And when their misdeeds come to light, they stage a grand spectacle of apologies and vows to change, only to strike back even harder later on.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s time to break free from this toxic cycle. I know it\u0026rsquo;s daunting, and fear may grip your heart initially, but liberate yourself from their clutches. You will discover a life far better than you ever imagined. You deserve more than this relentless manipulation. Embrace the freedom that awaits, my dear friend.\u003c/p\u003e\n\u003ch2 id=\"how-to-find-a-good-tool\"\u003eHow to find a good tool\u003c/h2\u003e\n\u003ch3 id=\"step-one-find-the-low-hanging-fruits\"\u003eStep One: Find The Low Hanging Fruits\u003c/h3\u003e\n\u003cp\u003eYou stand at the precipice of transformation, ready to change your life for the better. The first step is to identify the areas in your life that require attention. What needs are you seeking to fulfill? And upon which inadequate services are you currently relying?\u003c/p\u003e\n\u003cp\u003eIn my case, I sought:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eA steady flow of lightweight information.\u003c/li\u003e\n\u003cli\u003eDaily interactions with fellow enthusiasts akin to myself.\u003c/li\u003e\n\u003cli\u003eA means to uncover specific data.\u003c/li\u003e\n\u003cli\u003eA reliable way to send emails.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eFor too long, I depended on subpar sources to meet these needs. For the first two, I found myself reliant on Twitter, Instagram, Reddit, and Google News. As for the third and fourth requirements, I resorted to Google\u0026rsquo;s services. However, all of these platforms consistently fell short and inflicted undue stress upon me.\u003c/p\u003e\n\u003ch3 id=\"step-two-find-effective-replacements\"\u003eStep Two: Find Effective Replacements\u003c/h3\u003e\n\u003cp\u003eIn my earlier post I have mentioned that I already have replaced most of these services with better ones. But I have not mentioned what constitutes an effective solution.\u003c/p\u003e\n\u003cp\u003eIn \u003ca href=\"../web-experience-makeover\"\u003emy previous post\u003c/a\u003e, I alluded to having replaced many of these services with superior alternatives. However, I haven\u0026rsquo;t delved into what exactly makes a solution effective.\u003c/p\u003e\n\u003cp\u003eAllow me to outline the criteria and guiding principles for an empowering tool:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eIt should not cause you any harm.\u003c/li\u003e\n\u003cli\u003eIt should not lock you in.\u003c/li\u003e\n\u003cli\u003eIt should not feel frugal.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eNow, let me delve into the rationale behind these criteria:\u003c/p\u003e\n\u003ch4 id=\"1-dot-it-should-not-cause-you-more-harm-than-good\"\u003e1. It should not cause you more harm than good\u003c/h4\u003e\n\u003cp\u003eIf a tool causes more harm than good, why persist in using it at all?\u003c/p\u003e\n\u003cp\u003eTo safeguard your interests, ensure that the tool operates with transparency. Platforms that intentionally harm users are less inclined to be forthcoming about their inner workings. Opt for open-source and audited software, provided you trust the incentives and capabilities of the auditors, as this fosters transparency.\u003c/p\u003e\n\u003cp\u003eMoreover, it is crucial to align the incentives of the tool\u0026rsquo;s creators with your own. While there will always be some degree of misalignment, not all cases are equal. Selling or renting software may incentivize developers to plan for obsolescence, sell incomplete products, or enforce lock-ins. Yet, these misalignments are overshadowed by the egregious discrepancies inherent in ad-driven models.\u003c/p\u003e\n\u003ch4 id=\"2-dot-it-should-not-lock-you-in\"\u003e2. It should not lock you in\u003c/h4\u003e\n\u003cp\u003eIndeed, the peril of being locked into a tool becomes evident when the company\u0026rsquo;s incentives undergo a shift. I experienced this firsthand in 2015 when I was a loyal Evernote user with a premium subscription, trusting it with all my valuable information. However, when Evernote decided to drop right-to-left language support crucial for the Middle Eastern languages, my pleas for assistance fell on deaf ears. They deemed the region unworthy of attention, leaving me stranded and unable to utilize my data effectively.\u003c/p\u003e\n\u003cp\u003eThe true pain emerged when I attempted to export my information and realized I was trapped in their ecosystem. They held my notes hostage, providing them back only in a non-standard format through XML or JSON files. This, my friends, was the dreaded lock-in, and I had to endure a labyrinthine journey of manual extraction to break free.\u003c/p\u003e\n\u003cp\u003eTo avoid such a predicament, one essential question should be posed:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eWill it be more difficult for me to switch to a competitor once I\u0026rsquo;ve fully adopted this service compared to my current situation before using it?\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eIf the service retains your data and only offers it back in a non-standard format, it becomes significantly more challenging to transition to a competitor after investing your notes into the first service. Be vigilant and consider the implications before getting entangled in such situations.\u003c/p\u003e\n\u003ch4 id=\"3-dot-it-should-not-feel-frugal-dot\"\u003e3. It should not feel frugal.\u003c/h4\u003e\n\u003cp\u003eLet us keep in mind the essence of this endeavor: to enhance the quality of our lives. Undoubtedly, there are noble causes that may necessitate adopting a certain level of frugality, as was the case for me with animal rights, which amusingly led me to embrace veganism.\u003c/p\u003e\n\u003cp\u003eHowever, advocating for these causes demands energy, and it might inadvertently lead to isolation. We must acknowledge that not everything can or should be a constant battle. The purpose of utilizing these tools is to improve our lives, not to make them more arduous.\u003c/p\u003e\n\u003cp\u003eIf safeguarding your privacy to the utmost extreme is your goal, then by all means, employ complex passwords for each site and commit them to memory. Nevertheless, we must be mindful that our fighting energy is finite. Thus, it becomes essential to prioritize and channel our limited energy toward the most urgent and meaningful issues that truly resonate with our hearts.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eYou are on the right path, and I believe in you wholeheartedly! Trust me, I\u0026rsquo;ve been through this journey myself, and it turned out to be a delightful and straightforward experience. Take heart, for you can certainly achieve it too! Keep going, and you\u0026rsquo;ll soon realize how much better and easier life becomes. You\u0026rsquo;ve got this!\u003c/p\u003e\n",
            "date_published": "2023-07-29T12:14:00+03:30"
        }, {
            "title": "Giving My Exprience of Web a Makeover",
            "id": "https://prma.dev/posts/web-experience-makeover/",
            "url": "https://prma.dev/posts/web-experience-makeover/",
            "summary": "Intro Back in the good old days, I found myself drawn to the wonders of the internet, captivated by its virtual world, teeming with individuals who resonated with me, people I admired, or at least aspired to emulate. The communication channels of that era felt more personal, more akin to a lively conversation passed on through word of mouth.\nMore of Those Days In those youthful days, I\u0026rsquo;d eagerly scour the web for words that piqued the interests of my teenage self, and with a simple search, Google would present me with a treasure trove of blogs authored by kindred spirits.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eBack in the good old days, I found myself drawn to the wonders of the internet, captivated by its virtual world, teeming with individuals who resonated with me, people I admired, or at least aspired to emulate. The communication channels of that era felt more personal, more akin to a lively conversation passed on through word of mouth.\u003c/p\u003e\n\u003ch2 id=\"more-of-those-days\"\u003eMore of Those Days\u003c/h2\u003e\n\u003cp\u003eIn those youthful days, I\u0026rsquo;d eagerly scour the web for words that piqued the interests of my teenage self, and with a simple search, Google would present me with a treasure trove of blogs authored by kindred spirits. I\u0026rsquo;d venture into the realms of Twitter, FriendFeed, Facebook, Orkut, and the myriad other social platforms, spending precious moments escaping the painful realities of feeling marginalized by my parents, teachers, and peers at school.\u003c/p\u003e\n\u003cp\u003eThe internet of that era held a special place in my heart; it offered solace and kinship. Even though I may not have been as popular as some within those social circles, I cherished engaging in conversations within a vibrant crowd of amazing individuals, the very ones I admired deeply.\u003c/p\u003e\n\u003cp\u003eAs time marched on, many of the cherished online spaces I once loved fell by the wayside, while others morphed into monstrous entities, becoming tools of ostracization. Although I personally may not have been the target of such mistreatment, I could discern the toxic environment that fostered and emboldened bullies.\u003c/p\u003e\n\u003cp\u003eEven the search engines, once a source of discovery and connection, began to falter. Each passing day brought forth an ever-increasing deluge of hyper-\u003cabbr title=\"Search Engine Optimization\"\u003eSEO\u003c/abbr\u003e\n-optimized, meaningless content and tech-centric sites merely driven by profit, overtaking the slots that were once reserved for passionate individuals with independent blogs.\u003c/p\u003e\n\u003cp\u003eAs the landscape transformed, I gradually came to terms with the nostalgic allure of those bygone days, realizing that it had become a remnant of the lost innocence of the early internet or clouded by my own flawed perception of what truly transpired.\u003c/p\u003e\n\u003cp\u003eThe sense of desperation that had gripped me started to crumble when    \n\u0026rsquo;s actions on Twitter triggered a disillusionment, pushing me to reconsider Fosstodon-an open-source social platform. And oh, what a fortuitous decision that turned out to be. It was as if I had stumbled upon the early days of FriendFeed, where genuine exchange of information thrived, embodying the very essence of the social web I yearned for.\u003c/p\u003e\n\u003cp\u003eBut a part of me questioned this fortunate discovery. Could it merely be a chance occurrence, a fluke in the otherwise distorted realm of human-generated nonsense? I grappled with doubts.\u003c/p\u003e\n\u003cp\u003eThen, as if destiny had a hand in it, the second revelation struck-a website called Kagi, delivering yet another blow to the illusion I had held onto. The cracks in my previous beliefs widened, challenging me to confront the harsh realities of the digital landscape.\u003c/p\u003e\n\u003cp\u003eKagi, an unconventional paid search engine, piqued my curiosity, prompting me to give it a try. What unfolded before my eyes left me astounded-a screen brimming with blog posts dedicated to the concept of \u003cem\u003ePermaComputing\u003c/em\u003e occupied the very first page of results. In that moment, it dawned on me that the beloved world of independent blogging, which I had presumed to be on life support, had not faded away as I had believed. Instead, it thrived, resilient and as potent as ever. It was the so-called social media platforms and search engines, the very entities I had placed my trust in, that had ultimately let me down, betraying the internet I held dear.\u003c/p\u003e\n\u003cp\u003eThe illusion that once clouded my perception had dissipated into thin air.\u003c/p\u003e\n\u003cp\u003eDetermined to instigate a change, I took my first footsteps in the path full of transformations. I am currently in the midst of that process, but I have successfully identified the type of experience I desire. I have pinpointed a few readily available opportunities and have taken proactive measures to secure them for myself.\u003c/p\u003e\n\u003cp\u003eForemost, I yearn for an authentic perspective of the internet-a genuine representation of the collective human experience rather than a mere showcase of the glossiest and most superficial elements. To fulfill this aspiration, I sought out a suitable search engine, and as I mentioned earlier, I found my answer in Kagi-it aligns perfectly with my vision.\u003c/p\u003e\n\u003cp\u003eFurthermore, I crave a steady stream of thoughtful and sincere content. To achieve this, I turned to an \u003cabbr title=\"Realy Simple Syndication\"\u003eRSS\u003c/abbr\u003e\n aggregator to curate and deliver such material to me consistently. Feedbin emerged as the ideal choice, serving as the conduit for fulfilling my appetite for meaningful discourse.\u003c/p\u003e\n\u003cp\u003eI discovered another low-hanging fruit on my path towards a more fulfilling online experience-a social website optimized for community rather than being driven solely by journalists. This gem came in the form of Mastodon.\u003c/p\u003e\n\u003cp\u003eIn my quest for a trustworthy email service that respects my privacy and shields me from the relentless influx of spammers, I received a recommendation for ProtonMail. Taking heed of the suggestion, I made the switch and, so far, I find it to be a satisfactory choice.\u003c/p\u003e\n\u003cp\u003eYou may have noticed that out of the four aforementioned solutions, three are paid services. Additionally, two of them are closed-sourced, while one-the email service-poses the risk of vendor lock-in. Although this may not be the ideal scenario, I weighed my options against a set of criteria that I had established. In the end, these choices emerged as the better alternatives, despite their limitations.\u003c/p\u003e\n\u003cp\u003eHowever, I realize that this post has already grown quite lengthy, and the criteria I employed deserve a \u003ca href=\"../criteria-for-choosing-tools\"\u003emore thorough elaboration\u003c/a\u003e. Therefore, I will save their exploration for a future post, where I can delve deeper into these ideas deserving of greater attention.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eAt present, I find immense joy in my renewed online experience-a sense of tranquility and refuge washes over me whenever I delve into the internet. I wholeheartedly urge you, dear reader, who may be experiencing similar frustrations to those of my past self, to take a moment and reevaluate your internet usage. There is a strong possibility that the internet can be a much more pleasant and gratifying space than what you might be feeling at this moment. I know this to be true because I am living it right now. Embrace the journey of exploring better alternatives and reclaim the joy in your online interactions.\u003c/p\u003e\n",
            "date_published": "2023-07-19T12:04:00+03:30"
        }, {
            "title": "HTML, The Programming Language",
            "id": "https://prma.dev/posts/html_the_programming_language/",
            "url": "https://prma.dev/posts/html_the_programming_language/",
            "summary": "Intro Ah yes, the eternal dispute over whether HTML counts as a proper programming language seems to bring out the best and worst of our community\u0026rsquo;s collective rational faculties. A veritable feast of half-baked attempts to define away the problem by appealing to whatever convenient characteristics the speaker happens upon, combined with a sprinkling of more serious thinkers seeking some grand philosophical theory to explain it all. But don\u0026rsquo;t get your hopes up - you won\u0026rsquo;t find any silver bullet solutions here folks.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eAh yes, the eternal dispute over whether  \u003cabbr class=\"language\" title=\"Hyper-Text Markup Language\"\u003e\u003ca href=\"https://html.spec.whatwg.org/\"\u003eHTML\u003c/a\u003e\u003c/abbr\u003e\n counts as a proper programming language seems to bring out the best and worst of our community\u0026rsquo;s collective rational faculties. A veritable feast of half-baked attempts to define away the problem by appealing to whatever convenient characteristics the speaker happens upon, combined with a sprinkling of more serious thinkers seeking some grand philosophical theory to explain it all. But don\u0026rsquo;t get your hopes up - you won\u0026rsquo;t find any silver bullet solutions here folks. Just a parade of armchair theoreticians grasping blindly for some sense of clarity amidst the fog of poorly thought out positions. So gather \u0026lsquo;round, listen up, and prepare yourself for another round of pointless squabbling. The fun is just beginning!\u003c/p\u003e\n\u003ch2 id=\"the-loops-and-the-features\"\u003eThe Loops And The Features\u003c/h2\u003e\n\u003cp\u003eIndividuals frequently endeavor to delineate programming languages by differentiating them from \u003cabbr class=\"language\" title=\"Hyper-Text Markup Language\"\u003e\u003ca href=\"https://html.spec.whatwg.org/\"\u003eHTML\u003c/a\u003e\u003c/abbr\u003e\n, contending that a programming language possesses specified traits. Traits that might encompass looping structures, conditional statements, or even compilations. Alas, these efforts are founded upon retrospective comprehension - reliant on past personal observations of what constitutes a programming language. This flawed methodology, inherently, undermines the legitimacy of their claims inasmuch as they concurrently explore discrepancies between what is deemed not to be a programming language. A circular argument ensues, lacking genuineness, and thus futile in supporting the allegation that \u003cabbr class=\"language\" title=\"Hyper-Text Markup Language\"\u003e\u003ca href=\"https://html.spec.whatwg.org/\"\u003eHTML\u003c/a\u003e\u003c/abbr\u003e\n lacks programming language attributes.\u003c/p\u003e\n\u003cp\u003eAlright, listen up! Let\u0026rsquo;s say I\u0026rsquo;m dead set on accusing Tom of being a thieving scoundrel while vehemently asserting that Amanda is as innocent as can be. To make my case, I start off by drawing a sharp contrast between Tom and Amanda. Then, after much contemplation, I concoct a ridiculously specific definition of a thief: \u0026ldquo;Anyone who happens to be a man in his sixties with an academic background in History.\u0026rdquo; Can you believe that? Now, picture this - imagine we go ahead and convict every poor soul who fits this outrageous description. Well, I\u0026rsquo;ll tell you right now, that\u0026rsquo;s a load of nonsense! It simply won\u0026rsquo;t fly, and anyone with half a brain can see how utterly flawed and impractical that notion is.\u003c/p\u003e\n\u003ch2 id=\"the-turing-completeness\"\u003eThe Turing Completeness\u003c/h2\u003e\n\u003cp\u003eNow, let me tell you about those folks who prefer a more unified approach when it comes to defining something, like a programming language. They often rely on axioms, you know, those fundamental principles that serve as the bedrock of reasoning. One of the most famous examples is the notion of \u003cem\u003eTuring completeness\u003c/em\u003e being the ultimate defining factor. At first glance, it may not seem problematic. But here\u0026rsquo;s the burning question: Why on earth would we go down that route?\u003c/p\u003e\n\u003cp\u003eThink about it. We create distinctions in definitions to aid us in effectively communicating a concept amongst ourselves. As far as I know, most programmers couldn\u0026rsquo;t care less about whether a programming language can perform every single computation imaginable in theory. No, sir! Instead, they value the practical aspects like ease of use and reliability when it comes to solving a specific set of problems. So, how in the world would that earlier theoretical claim serve us in our day-to-day tasks? It\u0026rsquo;s a real head-scratcher, especially when you consider that such a filter would let languages like brainfuck and whitespace pass through, while disregarding \u003cem\u003etotal\u003c/em\u003e programming languages that could actually lead to more robust and dependable software.\u003c/p\u003e\n\u003cp\u003eBut here\u0026rsquo;s the kicker - some people actually advocate for this madness. They\u0026rsquo;ve come up with a seemingly cohesive definition of a programming language, but their motivations for choosing that definition are nothing more than an afterthought. As a result, their definitions are utterly useless, or at the very least, useless to those who couldn\u0026rsquo;t care less about denigrating a language. Can you believe it? What a ridiculous state of affairs!\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eNow, let me be clear, my intention here is not to rally behind \u003cabbr class=\"language\" title=\"Hyper-Text Markup Language\"\u003e\u003ca href=\"https://html.spec.whatwg.org/\"\u003eHTML\u003c/a\u003e\u003c/abbr\u003e\n and extol its virtues. Instead, I aim to shed light on our incessant desire to bestow added significance upon the definition of our work. And, quite frankly, I implore you to put an end to it. You see, a programming language can possess capabilities or be lacking in them, and a programmer may be focused on orchestrating the flow of information or on its presentation. We come in all shapes and forms, each with our unique approaches. Attempting to establish some sort of gatekeeping mechanism in this endeavor will only result in programmers overlooking the fact that they may just require \u003cabbr class=\"language\" title=\"Hyper-Text Markup Language\"\u003e\u003ca href=\"https://html.spec.whatwg.org/\"\u003eHTML\u003c/a\u003e\u003c/abbr\u003e\n and \u003cabbr class=\"language\" title=\"Casscading Style Sheet\"\u003e\u003ca href=\"https://www.w3.org/TR/CSS/#css\"\u003eCSS\u003c/a\u003e\u003c/abbr\u003e\n to fulfill their job requirements. This, in turn, contributes to the sorry state of the web-bloated and disheartening.\u003c/p\u003e\n\u003cp\u003eLet us cherish our roles as creators and refrain from placing undue emphasis on the definition of our jobs, but rather, let us focus on the outcomes we produce. After all, we are all creators and problem-solvers at heart.\u003c/p\u003e\n",
            "date_published": "2023-06-24T11:50:00+03:30"
        }, {
            "title": "Consider Developer's Snack",
            "id": "https://prma.dev/posts/consider_developers_snack/",
            "url": "https://prma.dev/posts/consider_developers_snack/",
            "summary": "Intro During my early 20s, I found myself immersed in the world of sustainable architecture as an architecture student. Engaging in various workshops centered around this field, one particular experience stands out as a monumental turning point in my life. It was a workshop conducted by a renowned professor in Iran, where I gained valuable insights. Within this workshop, we collectively brainstormed strategies to harness heat sources for a four-member family\u0026rsquo;s house, aiming to optimize its thermal efficiency.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eDuring my early 20s, I found myself immersed in the world of sustainable architecture as an architecture student. Engaging in various workshops centered around this field, one particular experience stands out as a monumental turning point in my life. It was a workshop conducted by a renowned professor in Iran, where I gained valuable insights.\nWithin this workshop, we collectively brainstormed strategies to harness heat sources for a four-member family\u0026rsquo;s house, aiming to optimize its thermal efficiency. We considered a range of possibilities, including solar and geothermal heat, as well as the heat generated by the kitchen oven. However, there was one significant heat source that eluded our attention, as pointed out persistently by the professor.\u003c/p\u003e\n\u003cp\u003eEventually, he provided us with a clue: \u0026ldquo;You seem to have overlooked four 37-degree Celsius heaters.\u0026rdquo; It dawned on us that we had forgotten to factor in the heat generated by the family members themselves. Their body heat, a natural source of warmth, had slipped our minds entirely.\u003c/p\u003e\n\u003cp\u003eReflecting on a more recent occurrence, a certain paper began circulating, comparing the energy usage footprint of different programming languages. Yet, I couldn\u0026rsquo;t help but notice that the discussions surrounding this paper overlooked a crucial aspect-it solely measured the energy footprint at one specific point in the application\u0026rsquo;s lifecycle.\u003c/p\u003e\n\u003cp\u003eIt is essential to recognize that the energy usage of a programming language extends beyond a mere snapshot analysis. To truly grasp the overall impact, we must consider the entire lifecycle of the application, accounting for factors such as development, deployment, maintenance, and eventual retirement. Only then can we gain a comprehensive understanding of the energy implications associated with different programming languages.\u003c/p\u003e\n\u003ch2 id=\"the-paper-as-the-thread-we-pull\"\u003eThe Paper, As The Thread We Pull\u003c/h2\u003e\n\u003cp\u003eThe paper, titled \u0026ldquo;Energy Efficiency Across Programming Languages,\u0026rdquo; delves into the exploration of various problems and their corresponding solutions, which are implemented across multiple programming languages. The researchers conducted an analysis of the electricity consumption associated with each implementation. In essence, the primary focus of the study revolves around determining the relative energy efficiency of different programming languages, with \u003ca class=\"language\" href=\"https://www.iso.org/standard/74528.html\"\u003eC\u003c/a\u003e\n emerging as the most efficient and serving as the benchmark for measurement.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eC      | 01.00 | \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eRust   | 01.03 | \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eJava   | 01.98 | \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ePython | 75.88 | \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ePerl   | 79.58 | \n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eThese results carry considerable weight, although it is essential to address a common misconception surrounding their implications. Contrary to popular belief, these findings do not unequivocally assert that a \u003ca class=\"language\" href=\"https://www.iso.org/standard/74528.html\"\u003eC\u003c/a\u003e\n program is inherently more environmentally sustainable than its \u003cdfn\u003eJava\u003c/dfn\u003e counterpart.\u003c/p\u003e\n\u003ch2 id=\"consider-the-snack\"\u003eConsider The Snack\u003c/h2\u003e\n\u003cp\u003eIn the field of sustainability literature, there exists a concept known as \u003cdfn\u003eLife-Cycle Assessment\u003c/dfn\u003e. \u003cabbr title=\"Life-Cycle Assessment\"\u003eLCA\u003c/abbr\u003e\n involves evaluating the environmental impact of a product throughout its entire life cycle, encompassing aspects such as raw material extraction, manufacturing, and disposal or recycling.\u003c/p\u003e\n\u003cp\u003eWhen applying this concept to the assessment of software life cycles, we realize that there are several significant factors that have been overlooked. Allow me to provide some insights on these important considerations.\u003c/p\u003e\n\u003cp\u003eFirstly, the authors of the paper have primarily focused on the runtime of a specific set of problems. This means that their applications follow a sequence of starting up, solving the given problem, and then exiting. Consequently, the results obtained are biased towards programming languages that excel at efficient startup and shutdown processes. However, this perspective fails to account for the behavior of servers and long-running processes. Servers, for instance, typically start up once per day or even less frequently and spend extended periods in the computational phase. If a programming language is efficient during the initial startup but requires frequent restarts during runtime, this crucial aspect is overlooked.\u003c/p\u003e\n\u003cp\u003eBut we shouldn\u0026rsquo;t stop there. Another aspect to consider is compilation. While \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n is indeed an impressive language, its compilation process is significantly more resource-intensive compared to \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n. \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n yields highly efficient binaries, but the energy expended during the compilation process is also considerably higher.\u003c/p\u003e\n\u003cp\u003eFurthermore, the improved quality of \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n\u0026rsquo;s compiled binaries becomes relevant when we consider the potential presence of bugs and the subsequent need for recompilation. More permissive compilers may result in programs with a higher likelihood of bugs, necessitating additional rounds of debugging, fixing, and retesting. It\u0026rsquo;s important to acknowledge that this discussion goes beyond the developer\u0026rsquo;s running computer and includes factors such as sustenance needs, energy consumption to support their biological functioning during the process of bug fixing, and the overall impact on the environment.\u003c/p\u003e\n\u003cp\u003eAdditionally, the continuous deployment or release cycles, repackaging efforts, and the use of \u003cabbr title=\"Continues Integration\"\u003eCI\u003c/abbr\u003e\n/\u003cabbr title=\"Continues Delivery\"\u003eCD\u003c/abbr\u003e\n practices all contribute to the \u003cem\u003eecological footprint\u003c/em\u003e. Recompilation for each platform targeted, as well as the network costs associated with distributing binaries or source code to different endpoints, also significantly impact the environment.\u003c/p\u003e\n\u003cp\u003eThe problem of compatibility further compounds the issue. Programming languages with runtimes shipped separately from the package, such as \u003ca class=\"language\" href=\"https://www.python.org/\"\u003ePython\u003c/a\u003e\n, \u003ca class=\"language\" href=\"https://lua.org/\"\u003eLua\u003c/a\u003e\n, and other scripting or \u003cabbr title=\"Just-In-Time [compilation]\"\u003eJIT\u003c/abbr\u003e\n languages, as well as those based on virtual machines like \u003cabbr title=\"Java Virtual Machine\"\u003eJVM\u003c/abbr\u003e\n, often require reprogramming or the inclusion of older runtime versions when breaking changes occur. This adds to the complexity and environmental impact of software development and packaging.\u003c/p\u003e\n\u003cp\u003eFurthermore, poorly designed programs can accumulate significant technical debt over time, resulting in rewriting. Although the language and toolchain themselves may not directly cause this, the ecosystem surrounding languages like \u003cabbr class=\"language\" title=\"JS\"\u003e\u003ca href=\"https://ecma-international.org/publications-and-standards/standards/ecma-262/\"\u003eJavaScript\u003c/a\u003e\u003c/abbr\u003e\n, \u003cabbr class=\"language\" title=\"PHP: Hypertext Preprocessor\"\u003e\u003ca href=\"https://www.php.net/\"\u003ePHP\u003c/a\u003e\u003c/abbr\u003e\n, and \u003ca class=\"language\" href=\"https://www.python.org/\"\u003ePython\u003c/a\u003e\n   tends to encourage short-term thinking. In contrast, languages like \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n, \u003ca class=\"language\" href=\"https://www.iso.org/standard/74528.html\"\u003eC\u003c/a\u003e\n, \u003ca class=\"language\" href=\"https://fortran-lang.org/\"\u003eFortran\u003c/a\u003e\n, and others that focus on system-level development promote long-term support and are home to projects that have thrived for several decades.\u003c/p\u003e\n\u003cp\u003eMoreover, the variability in usage patterns must be taken into account. While languages like \u003ca class=\"language\" href=\"https://www.iso.org/standard/74528.html\"\u003eC\u003c/a\u003e\n  and \u003cabbr class=\"language\" title=\"C\u0026#43;\u0026#43;\"\u003e\u003ca href=\"https://isocpp.org/\"\u003eCpp\u003c/a\u003e\u003c/abbr\u003e\n require substantial energy for compilation across different platforms, languages such as \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n, \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n, and \u003ca class=\"language\" href=\"https://www.java.com\"\u003eJava\u003c/a\u003e\n mitigate the duplication of energy required to support multiple platforms within a single application.\u003c/p\u003e\n\u003cp\u003eFinally, we must consider the energy expended in the development, maintenance, and support of programming languages. Languages like \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n offer remarkable expressive capabilities, not merely due to better timing or superior thinking but also as a result of extensive collaborative efforts. Conversely, languages like \u003ca class=\"language\" href=\"https://elm-lang.org/\"\u003eElm\u003c/a\u003e\n undergo minimal changes over time.\u003c/p\u003e\n\u003cp\u003eIt is worth emphasizing that the energy required to learn a language, the environmental consequences of mistakes made during coding (e.g., unintentionally sending a million requests to thousands to different servers), variations in energy usage among developers from different countries, and the decreasing lifespan of hardware are all factors that contribute to the overall consideration.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eThe crux of the matter is that complexity pervades these considerations, demanding our thoughtful attention and appropriate mitigation for each aspect. Failing to acknowledge and address each facet places us at risk of optimizing solely for one element while sacrificing the other to the extent of rendering our efforts absurd.\u003c/p\u003e\n\u003cp\u003eIt is important to note that I have deliberately omitted discussions about post-harm mitigation. Our focus has been on reducing harm itself. Exploring the costs associated with bootstrapping and averting catastrophic scenarios would expand beyond the scope of this essay.\u003c/p\u003e\n",
            "date_published": "2023-06-21T11:43:00+03:30"
        }, {
            "title": "FLOSS For Software Longevity",
            "id": "https://prma.dev/posts/floss_for_longevity/",
            "url": "https://prma.dev/posts/floss_for_longevity/",
            "summary": "Intro Free/Libre and Open Source Software (FLOSS ) is a captivating realm within software development. What makes FLOSS particularly intriguing is its deviation from conventional business goals, leading to planned longevity and a distinct approach to sustainability.\nReasons Let us delve into the unique qualities of FLOSS and the factors that contribute to its better suitability for longevity.\nThe longevity of the FLOSS business model serves it well The common business models are better suited for short-term goals.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eFree/Libre and Open Source Software (\u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n) is a captivating realm within software development. What makes \u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n particularly intriguing is its deviation from conventional business goals, leading to planned longevity and a distinct approach to sustainability.\u003c/p\u003e\n\u003ch2 id=\"reasons\"\u003eReasons\u003c/h2\u003e\n\u003cp\u003eLet us delve into the unique qualities of \u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n and the factors that contribute to its better suitability for longevity.\u003c/p\u003e\n\u003ch3 id=\"the-longevity-of-the-business-model-serves-it-well\"\u003eThe longevity of the \u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n business model serves it well\u003c/h3\u003e\n\u003cp\u003eThe common business models are better suited for short-term goals. There are two major approaches: selling or renting.\u003c/p\u003e\n\u003cp\u003eSmall to mid-sized software companies predominantly prioritize the sale of their products. The concept of product longevity, while acknowledged as necessary, assumes a secondary role rather than being a central objective. Its primary function lies in establishing trust among consumers. Once the initial excitement surrounding the launch of a new and captivating product subsides, these companies swiftly shift their attention to the next innovation. The success of marketing these novel products heavily relies on users\u0026rsquo; fear of missing out and the perceived loss of functionality associated with the previous iteration. Unfortunately, this often leads to the inclusion of unnecessary features, deliberate planning for obsolescence, and resistance against the right to repair. In this cycle, longevity takes a backseat as the perpetual replacement of one product with another takes precedence.\u003c/p\u003e\n\u003cp\u003eConversely, larger companies place a premium on the rental model for software. Instead of users owning the software outright, they opt for subscription-based payment models for continuous usage. One might assume that these companies would prioritize stability to retain their subscribers. However, practical implementation often takes a different route. These companies rely on monopolistic tactics, such as acquiring competitors or launching extensive marketing campaigns to stifle new entrants. In cases where competition persists, they resort to content exclusivity, coercing users to purchase their product alongside competitors\u0026rsquo; offerings. Consequently, users find themselves utilizing these products for prolonged periods not due to their exceptional quality, but rather because they perceive limited alternative options. The subscription model may make sense when paying for a service, but it doesn\u0026rsquo;t align with current software development. Paying subscription for developing and bug-fix of a product is simply paying for the privilege of using an incomplete version of a product.\u003c/p\u003e\n\u003cp\u003eIn contrast, companies adopting a pay-for-enterprise-support model for open-source products, such as Canonical and Red Hat, exhibit commendable practices. Their primary emphasis lies on longevity. If the software is functioning adequately, their tasks are straightforward, eliminating the need to address the same issue repeatedly for each client. Longevity serves as both their evidence and modus operandi. They provide support for software that has already weathered numerous instabilities. They employ different development stages, such as alpha, unstable, stable, and long-term releases. These features can subsequently be passed on to other distributions with more robust objectives, such as REHL.\u003c/p\u003e\n\u003cp\u003eAlthough these companies may impose charges for bug fixes, their underlying offering revolves around selling stability and longevity (think \u003cem\u003eUbuntu Pro\u003c/em\u003e). This approach is not driven solely by inherent benevolence but rather stems from a lack of alternatives. They are unable to monopolize a product that can be cloned, forked, and utilized to initiate independent ventures. Nor can they vend software that others can fork, enhance, and sell at higher prices or even distribute for free. Their sole viable course of action entails creating a product that strikes a balance, avoiding both excessive limitations that render it futile and excessive complexity that complicates support.\u003c/p\u003e\n\u003cp\u003eHowever, business is just one piece of the puzzle.\u003c/p\u003e\n\u003ch3 id=\"engineers-prioritize-quality-over-quantity\"\u003e\u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n engineers prioritize quality over quantity\u003c/h3\u003e\n\u003cp\u003eAs we discussed, most businesses prioritize product quality only until it reaches a level sufficient for selling.\u003c/p\u003e\n\u003cp\u003eThis often leads to engineers being pushed and encouraged to develop faster, sacrificing quality and stability when it hinders \u0026ldquo;beating the competition to market.\u0026rdquo; I\u0026rsquo;m sure I\u0026rsquo;m not alone in feeling dissatisfied with creating instant legacy products and leaving behind a trail of subpar, useless software. It leaves no room for pride in one\u0026rsquo;s work.\u003c/p\u003e\n\u003cp\u003eAs a result, engineers who value quality find satisfaction in other avenues, such as personal projects or contributing to libraries and tools they use themselves.\u003c/p\u003e\n\u003cp\u003eThe dynamics of development in these situations differ. Open-source software often lacks the same level of resources, making maintainability a crucial concern. Allowing technical debt to accumulate in a project one maintains can result in paying a hefty price, even in a short period. The more users a project has, the more the burden of technical debt becomes apparent-quite the opposite of the industry\u0026rsquo;s \u0026ldquo;move broken things, fast\u0026rdquo; mentality.\u003c/p\u003e\n\u003cp\u003eConsequently, successful open-source products tend to have meticulous and uncompromising maintainers.\u003c/p\u003e\n\u003cp\u003eAnother important aspect to consider is that open-source software greatly enhances one\u0026rsquo;s resume. Similar to a resume, open-source projects showcase an individual\u0026rsquo;s best work. They are like first dates, where you present yourself at your best. Consequently, open-source projects motivate developers to create their finest code and documentation.\u003c/p\u003e\n\u003cp\u003eFurthermore, transparency is a vital aspect of open-source projects. Engaging in dubious practices, such as intrusive telemetry, can agitate the surrounding community.\u003c/p\u003e\n\u003cp\u003eIn summary, there are four main reasons:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThe cost of maintainability\u003c/li\u003e\n\u003cli\u003eThe positive impact on one\u0026rsquo;s resume\u003c/li\u003e\n\u003cli\u003eCounteracting the lack of satisfaction caused by lower quality software in daily work\u003c/li\u003e\n\u003cli\u003eEmbracing transparency\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3 id=\"exhibits-a-greater-degree-of-diversity-dot\"\u003e\u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n exhibits a greater degree of diversity.\u003c/h3\u003e\n\u003cp\u003eWhen it comes to a biological ecosystem, its resilience stems from the diversity of its members. Let\u0026rsquo;s imagine a scenario involving a moth that feeds on maple tree branches. In a jungle filled with maple trees, the moth can feast and reproduce endlessly. However, there\u0026rsquo;s a twist.\u003c/p\u003e\n\u003cp\u003eAround 10% of the maple trees have developed a variation of their membrane that is toxic to the moth, purely by chance. Now, if the moth tries to feed on these trees, it has a 1 in 10 chance of being fatally poisoned. If there were only a single moth, it would be the end of its lineage. However, imagine a population of 100 moths, and 10% of them have accidentally developed immunity. These \u0026ldquo;super moths\u0026rdquo; may be larger and more resistant to the trees, but they are also more visible to predators like birds. And so, the cycle continues.\u003c/p\u003e\n\u003cp\u003eThe diversity of approaches within a biological ecosystem is crucial. In the context of biological beings, the exchange of random sets of genes through sexual reproduction likely emerged as a means to enhance resilience. Microbes that prey on others, on the other hand, face a more challenging situation, as the result.\u003c/p\u003e\n\u003cp\u003eThese advantageous mechanisms resulting from diversity are also present in the software ecosystem.\u003c/p\u003e\n\u003cp\u003eThe needs and threats faced by a server differ from those faced by a German student\u0026rsquo;s laptop. While Linux is ubiquitous in the open-source desktop realm, there are numerous slightly different Linux distributions available. These variations encompass different themes, preinstalled applications, package managers, and even packaging architecture models. Additionally, there are kernels compiled with different flags and versions.\u003c/p\u003e\n\u003cp\u003eGiven this remarkable diversity, it comes as little astonishment that Microsoft\u0026rsquo;s ardent campaign during the 2000s against the comparably youthful, less cohesive, and resource-limited Linux met with abysmal failure. Strikingly, in a twist of events, Microsoft has lately unveiled its very own Linux distribution and dedicated years to crafting the Windows Subsystem for Linux.\u003c/p\u003e\n\u003cp\u003eTo the proprietary realm, an ecosystem characterized by the development, redesign, and forking of diverse products, yielding a multitude of solutions, may appear inherently inefficient. Yet, from the perspective of permaculture and PermaComputing, such an ecosystem manifests as nothing short of utopia.\u003c/p\u003e\n\u003ch3 id=\"demonstrates-a-higher-level-of-robustness\"\u003e\u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n demonstrates a higher level of robustness\u003c/h3\u003e\n\u003cp\u003e\u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n transcends being a mere generator of independent variations that begin anew each time. It represents a system where progress builds upon existing foundations, with each subsequent layer amplifying the importance of the underlying ones. Irrespective of how many stories above the ground one ascends, the ground level remains a paramount concern if its integrity is jeopardized. Prominent examples of this phenomenon can be observed in projects like curl, the kernel, and OpenSSL. Although these initiatives were initially initiated by individuals, they have evolved into integral components of numerous other undertakings. The driving force compelling many individuals to contribute to these projects stems from the realization that the cost of abstaining from participation would be significantly greater.\u003c/p\u003e\n\u003cp\u003eHowever, it is important to recognize that this process is not always pleasant. Consider the immense pressure on OpenSSL developers. If they were to become overwhelmed and exhausted like many other open-source maintainers, the consequences could be significant.\u003c/p\u003e\n\u003cp\u003eYet, when such challenges arise (and they do), we all become aware of them. We sense the danger and collectively strive to find solutions. This is in stark contrast to the situation when a proprietary software developer abandons a company. Until a replacement is found, users are left unaware and vulnerable to potential security threats posed by malicious hackers.\u003c/p\u003e\n\u003cp\u003eThanks to this collective effort and attention to robustness, many foundational open-source software programs have remained the best tools for the job even after decades of use.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eNow, esteemed reader, I trust you comprehend the rationale behind why individuals with a penchant for enduring solutions find the realm of \u003cabbr title=\"Free/Libre and Open Source Software\"\u003eFLOSS\u003c/abbr\u003e\n far more fertile than its alternatives.\u003c/p\u003e\n",
            "date_published": "2023-06-14T11:26:00+03:30"
        }, {
            "title": "Go Vs Rust readability",
            "id": "https://prma.dev/posts/go_vs_rust_readability/",
            "url": "https://prma.dev/posts/go_vs_rust_readability/",
            "summary": "Intro Traditionally speaking, Go and Rust are not direct competitors on many fronts. Each take different trade-offs. But more often than not, you might need to choose one over the other. It is compared in the niche the other fails. Like low-level system development, which Rust easily rules. Or maybe dev-ops tooling which Go is easily good at it.\nHowever, there are many overlaps in their use case. Think high-performance web-servers.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eTraditionally speaking, \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n and \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n are not direct competitors on many fronts. Each take different trade-offs. But more often than not, you might need to choose one over the other. It is compared in the niche the other fails. Like low-level system development, which \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n easily rules. Or maybe dev-ops tooling which \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n is easily good at it.\u003c/p\u003e\n\u003cp\u003eHowever, there are many overlaps in their use case. Think high-performance web-servers. In those spaces, we should compare other things. Like readability and maintainability of language. In this post, I want to share my thoughts on readability.\u003c/p\u003e\n\u003ch2 id=\"tl-dr\"\u003eTl;DR\u003c/h2\u003e\n\u003cp\u003e\u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n is not less maintainable than \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n because \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n is less readable.\u003c/p\u003e\n\u003ch2 id=\"what-i-do-not-disagree-with\"\u003eWhat I do not disagree with\u003c/h2\u003e\n\u003cp\u003eJust to be clear, although I\u0026rsquo;m making a case for \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n and arguing that readability should not be as much concern, I would like to make clear that I\u0026rsquo;m not arguing against these common-sense statements:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n is more readable.\u003c/li\u003e\n\u003cli\u003e\u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n has less overhead for people with no previous experience with language.\u003c/li\u003e\n\u003cli\u003eReadability is generally what you want.\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2 id=\"why-readability-is-good\"\u003eWhy readability is good\u003c/h2\u003e\n\u003cp\u003eEnglish is more readable than any programming language. However, readability is not the only measure that we are using for chosing a language.\u003c/p\u003e\n\u003cp\u003eReadability and clearity are not inherently good, rather it is a proxy for something else we value: A readable code helps us understand the flow of information in order to \u003cstrong\u003eunderstand its logic\u003c/strong\u003e, \u003cstrong\u003ecapture its bugs\u003c/strong\u003e and \u003cstrong\u003eextend it\u003c/strong\u003e, easier. A line of code is read in many situations:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eI want to find out how a piece of code can give rise to a specific runtime bug.\u003c/li\u003e\n\u003cli\u003eI want to audit it to see if it exposes any specific vulnerability, data-race, etc.\u003c/li\u003e\n\u003cli\u003eI want to add features to it, and I want to know where and how I should plug the new functionality to.\u003c/li\u003e\n\u003cli\u003eI want to make a code more robust, document it and make it more available for other people by refactoring it.\u003c/li\u003e\n\u003cli\u003eI want to review the code of my colleague to see if a set of fresh eyes could capture a new bug, or an inconsistent styling with the rest of the codebase.\u003c/li\u003e\n\u003cli\u003eI want to understand what a code base does. Maybe I\u0026rsquo;m trying to see if a  software is spying on me, or maybe I\u0026rsquo;m trying to understand the way it calculated my taxes.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThese are all noble pursuits. And in all these cases, readability is vital in preventing disasters and better experience in onboarding others.\n\u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n\u0026rsquo;s readability is probably one of its best features. At my current and previous jobs, I have had to jump into different code bases with different levels of legacy and problematic codebases where junior developers with no-idea of idiomatic ways of coding \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n left their projects without any context for the next developer.\nSuch low quality codes should take forever for one to decode. However, because of the beautifully simple syntax of \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n, I could start to be productive and sending PRs in less than a day. Have you seen a codebase where all the back-end code was coded by a narcissistic lone-wolf meth-addict? Well, I have, and it\u0026rsquo;s an absolute shit-show. Yet, I committed my first edits in 3 hours. \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n is excellent at that. And I can understand how a huge tech company with very quick employee turn-over can give rise to such language. Kudos to the \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n team.\u003c/p\u003e\n",
            "date_published": "2023-04-14T23:49:00+03:30"
        }, {
            "title": "Moving in Rust is Pure",
            "id": "https://prma.dev/posts/moving_is_pure/",
            "url": "https://prma.dev/posts/moving_is_pure/",
            "summary": "Intro The act of moving arguments within Rust \u0026rsquo;s functions serves as a compelling means to uphold the purity of the function. By embracing this practice, we ensure that the function operates on unique ownership of its inputs, preserving the integrity and immutability of data, which are fundamental tenets of functional programming.\nMoving a Variable to a Function in Rust Doesn\u0026rsquo;t Make It Impure So as an introduction, if you don\u0026rsquo;t know Rust .",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eThe act of moving arguments within \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n\u0026rsquo;s functions serves as a compelling means to uphold the \u003cem\u003epurity\u003c/em\u003e of the function. By embracing this practice, we ensure that the function operates on unique ownership of its inputs, preserving the integrity and \u003cem\u003eimmutability\u003c/em\u003e of data, which are fundamental tenets of \u003cem\u003efunctional programming\u003c/em\u003e.\u003c/p\u003e\n\u003ch2 id=\"moving-a-variable-to-a-function-in-doesn-t-make-it-impure\"\u003eMoving a Variable to a Function in \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n Doesn\u0026rsquo;t Make It Impure\u003c/h2\u003e\n\u003cp\u003eSo as an introduction, if you don\u0026rsquo;t know \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n.\u003c/p\u003e\n\u003cp\u003eIn \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n, we have this concept of \u003cem\u003emoving\u003c/em\u003e variables. It is like this:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-rust\" data-lang=\"rust\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e//  A variable is made.\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e\u003c/span\u003e\u003cspan style=\"font-weight:bold;font-style:italic\"\u003elet\u003c/span\u003e a_variable = some_value;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e// It moves into this function.\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e\u003c/span\u003e_ = a_function_that_takes_ownership(a_variable);\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e// We cannot use a_variable anymore! So, we cannot do this!\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e\u003c/span\u003e\u003cspan style=\"font-weight:bold;font-style:italic\"\u003elet\u003c/span\u003e b_variable = a_variable;\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eNow I consider \u003ccode\u003ea_function_that_takes_ownership\u003c/code\u003e to be a \u003cem\u003epure function\u003c/em\u003e. However, it raises a possible confusion:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eDoesn\u0026rsquo;t a_function_that_takes_ownership change the state of the outer function? Isn\u0026rsquo;t that a side effect?\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI argue that it doesn\u0026rsquo;t. Here is why: a function is not a function call. Ok. let\u0026rsquo;s visualize it.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      ________outer_function_______\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e--in-\u0026gt;|       __inner_f___        |-out-\u0026gt;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      | -in-\u0026gt; |          | -out-\u0026gt; |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      |       ------------        |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      -----------------------------\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eSo we have two functions. One outer, and one inner.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEach function should have inputs and an output.\u003c/li\u003e\n\u003cli\u003eOther than their outputs, they should not change anything outside their function space.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf these conditions are not met, our function is not \u003cem\u003epure\u003c/em\u003e.\u003c/p\u003e\n\u003ch3 id=\"step-1\"\u003eStep 1\u003c/h3\u003e\n\u003cp\u003eNow consider a variable \u003ccode\u003e[V]\u003c/code\u003e.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      _____________________________\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e-----\u0026gt;| [v]   ____________        |-----\u0026gt;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      | ----\u0026gt; |          | -----\u0026gt; |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      |       ------------        |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      -----------------------------\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch3 id=\"step-2\"\u003eStep 2\u003c/h3\u003e\n\u003cp\u003eWith our outer function, we create a function call for the inner function.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      _____________________________\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e-----\u0026gt;|       ____________        |-----\u0026gt;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      | [v]-\u0026gt; |          | -----\u0026gt; |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      |       ------------        |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      -----------------------------\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch3 id=\"step-3\"\u003eStep 3\u003c/h3\u003e\n\u003cp\u003eIt is no longer in the state space of the outer function. The inner function takes \u003cem\u003eownership\u003c/em\u003e of it.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      _____________________________\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e-----\u0026gt;|       ____________        |-----\u0026gt;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      | ----\u0026gt; |   [v]    | -----\u0026gt; |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      |       ------------        |\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e      -----------------------------\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eSemantically, for the outer function \u003ccode\u003e[v]\u003c/code\u003e was used in the function call and then dropped. Which does not violate our rules. For the inner function, it just got an input and returns an output. So it makes sematic sense.\u003c/p\u003e\n\u003cp\u003eIn practice, it also makes the same guarantees as any other \u003cem\u003epure function\u003c/em\u003e: - No null pointers. - No \u003cem\u003emutable state\u003c/em\u003e. - No \u003cem\u003eside effects\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eIf the caller \u003ccode\u003e.clone()\u003c/code\u003e our value and make a copy of it and pass that to the inner function, it provides us with no other guarantees, other than more memory usage and slightly longer code.\u003c/p\u003e\n\u003ch2 id=\"why-does-it-matter\"\u003eWhy does it matter?\u003c/h2\u003e\n\u003cp\u003eWell, Honestly, it doesn\u0026rsquo;t. I just had to decide if in a \u003cem\u003epure function\u003c/em\u003e I can consume a self, if I want to make it a \u003cem\u003epure function\u003c/em\u003e, considering that I cannot make it \u003cem\u003econst\u003c/em\u003e. This was my thinking output. Now you are the outer function.\u003c/p\u003e\n",
            "date_published": "2023-04-09T10:44:00+03:30"
        }, {
            "title": "Hachyderm or Fosstodon",
            "id": "https://prma.dev/posts/hachyderm_or_fosstodon/",
            "url": "https://prma.dev/posts/hachyderm_or_fosstodon/",
            "summary": "Intro Ever since I have moved to the mastodon platform after the great twitter migration. I was curious about two main instances. One being Fosstodon, an instance oriented around FOSS , another being Hachyderm, an instance that introduces itself as social media for technical professionals.\nEventualy, I decided to go with Fosstodon, as I liked what I was seeing there more. But I couldn\u0026rsquo;t put my finger on what it was that I liked more about Fosstodon, even though many of my favorite people resided on Hachyderm, the instance owner of the Hachyderm herself, being one examples.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eEver since I have moved to the mastodon platform after \u003cem\u003ethe great twitter migration\u003c/em\u003e. I was curious about two main instances.\nOne being \u003ca href=\"https://fosstodon.org\"\u003eFosstodon\u003c/a\u003e, an instance oriented around  \u003cabbr title=\"Free and Open Source Software\"\u003eFOSS\u003c/abbr\u003e\n, another being \u003ca href=\"https://hachyderm.io\"\u003eHachyderm\u003c/a\u003e, an instance that introduces itself as social media for technical professionals.\u003c/p\u003e\n\u003cp\u003eEventualy, I decided to go with Fosstodon, as I liked what I was seeing there more.\nBut I couldn\u0026rsquo;t put my finger on what it was that I liked more about Fosstodon, even though many of my favorite people resided on Hachyderm, the instance owner of the Hachyderm herself, being one examples.\u003c/p\u003e\n\u003ch2 id=\"initial-theories\"\u003eInitial Theories\u003c/h2\u003e\n\u003cp\u003eInitially I thought Hachyderm was more business-oriented. It seemed that people on Hachyderm were more interested about talking about broader technologies like \u003cem\u003ekubernetes\u003c/em\u003e and \u003cem\u003edocker\u003c/em\u003e, while at the same time there was a lot of talk about codes and \u003cem\u003eprogramming practices\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eI thought maybe all the programmers on Hachyderm are working with more proprietory and enterprise solutions and as such they were less likely to share details of their daily programming.\u003c/p\u003e\n\u003cp\u003eBut that theory didn\u0026rsquo;t hold true, as there was as much toots in my timeline on Fosstodon about bussiness related stuff as there was on Hachyderm.\u003c/p\u003e\n\u003cp\u003eUntil last night that I realized that maybe what I was seeing was the difference of ideas between operations interested people vs people involved in developing software. And as a backend-developer, I could see more relevant content from the development side.\u003c/p\u003e\n\u003cp\u003eSo I set to examine my assumptions.\nLike a good \u003ca href=\"https://www.lesswrong.com/tag/bayes-theorem\"\u003eBayesian\u003c/a\u003e.\u003c/p\u003e\n\u003ch2 id=\"apis-searches-and-methods\"\u003eAPIs, Searches and Methods\u003c/h2\u003e\n\u003cp\u003eto start with, I looked into different websites that could help me search per-instance results.\nThat way I could search differnet keywords in each instance and compare the results.\nHowever I could not find such a thing. Every search engine I tried lacked the ability of filtering by instance.\u003c/p\u003e\n\u003cp\u003eAfter that, I looked into the Mastodon \u003cabbr title=\"Application Programming Interface\"\u003eAPI\u003c/abbr\u003e\ns myself.\nLong-story short, I found \u003ca href=\"https://docs.joinmastodon.org/methods/timelines/#tag\"\u003etimeline API\u003c/a\u003e to be particularly useful:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-http\" data-lang=\"http\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#666;font-weight:bold;font-style:italic\"\u003eGET\u003c/span\u003e \u003cspan style=\"color:#666;font-weight:bold;font-style:italic\"\u003e/api/v1/timelines/tag/:hashtag\u003c/span\u003e \u003cspan style=\"font-weight:bold\"\u003eHTTP\u003c/span\u003e/1.1\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eUsing this I could get a list of toots in \u003cabbr title=\"JavaScript Object Notation\"\u003eJSON\u003c/abbr\u003e\n format that had specific hashtags.\nAnd then filter those results to only get the actual url.\nI used \u003ccode\u003ecurl\u003c/code\u003e to make \u003cabbr title=\"Application Programming Interface\"\u003eAPI\u003c/abbr\u003e\n requests and \u003ccode\u003ejq\u003c/code\u003e to filter-out the keys I was not interested in.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-bash\" data-lang=\"bash\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/container?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eAnd then, I had to filter out results that were not from Hachyderm or Fosstodon. And Sort each\nFor filtering \u003ccode\u003eawk\u003c/code\u003e was perfect, and then for sorting the \u003ccode\u003esort\u003c/code\u003e command is good enough.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-shell\" data-lang=\"shell\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eawk \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;/fosstodon|hachyderm/ {print $0}\u0026#39;\u003c/span\u003e hash.json | sort \u0026gt; res-ops\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eI just had to come up with a few keywords that I could associate more with operations and a few for development.\u003c/p\u003e\n\u003cdiv class=\"note\"\u003e\n\u003cp\u003eAs you may have noticed, my methodoloy is hardly scientific and and extremly relient on subjective definitions.\nMy goal was to find a good-enough-for-my-decision result. Not anything more.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003eI ended up with these words on differnt sides:\u003c/p\u003e\n\u003ctable\u003e\n\u003cthead\u003e\n\u003ctr\u003e\n\u003cth\u003eOperations\u003c/th\u003e\n\u003cth\u003eDevelopment\u003c/th\u003e\n\u003c/tr\u003e\n\u003c/thead\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003eKubernetes\u003c/td\u003e\n\u003ctd\u003eRefactor\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eMontioring\u003c/td\u003e\n\u003ctd\u003eDebugging\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eDocker\u003c/td\u003e\n\u003ctd\u003eGreenfield\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eContainer\u003c/td\u003e\n\u003ctd\u003eFramework\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eTerraform\u003c/td\u003e\n\u003ctd\u003eCompiler\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eDeploy\u003c/td\u003e\n\u003ctd\u003eInterpreter\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eBaremetal\u003c/td\u003e\n\u003ctd\u003eTesting\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eVm\u003c/td\u003e\n\u003ctd\u003eIde\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eAdmin\u003c/td\u003e\n\u003ctd\u003eLibrary\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eServer\u003c/td\u003e\n\u003ctd\u003eDesignPatterns\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e_\u003c/td\u003e\n\u003ctd\u003eLSP\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e_\u003c/td\u003e\n\u003ctd\u003e\u003cspan class=\"language\"\u003eNodeJS\u003c/span\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e_\u003c/td\u003e\n\u003ctd\u003e\u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e_\u003c/td\u003e\n\u003ctd\u003eAuth\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003eThe differnece in their numbers are not important to us, only the proportions of the results of each may be relevant.\u003c/p\u003e\n\u003cdetails\u003e\n\u003csummary\u003eThe eventual code looks like this.\u003c/summary\u003e\n\u003cdiv class=\"details\"\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-shell\" data-lang=\"shell\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-weight:bold\"\u003e#! /usr/bin/env bash\n\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-weight:bold\"\u003e\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e# this part gives us a file with results of the OPs-related keywords\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/kubernetes?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/docker?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/container?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/operations?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/terraform?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/deploy?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/baremetal?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/vm?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/monitoring?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/admin?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/server?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eawk \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;/fosstodon|hachyderm/ {print $0}\u0026#39;\u003c/span\u003e hash.json | sort \u0026gt; res-ops \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003erm hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003e\u003cspan style=\"color:#888;font-style:italic\"\u003e# this part gives us a file with results of the Devs-related keywords\u003c/span\u003e\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/develop?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/refactor?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/greenfield?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/framework?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/compiler?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/interpreter?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/testing?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/ide?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/library?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/development?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/designpatterns?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/lsp?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/nodejs?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/rust?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/auth?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003ecurl \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;https://hachyderm.io/api/v1/timelines/tag/debuggin?\u0026amp;limit=1000\u0026#39;\u003c/span\u003e | jq \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;.[].url\u0026#39;\u003c/span\u003e \u0026gt;\u0026gt; hash.json \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eawk \u003cspan style=\"color:#666;font-style:italic\"\u003e\u0026#39;/fosstodon|hachyderm/ {print $0}\u0026#39;\u003c/span\u003e hash.json | sort \u0026gt; res-develop \u0026amp;\u0026amp;\n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003erm hash.json\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/details\u003e\n\u003ch2 id=\"the-result\"\u003eThe Result\u003c/h2\u003e\n\u003cp\u003eOn the ops query we have \u003ccode\u003e32\u003c/code\u003e toots from Fosstodon and \u003ccode\u003e44\u003c/code\u003e toots from Hachyderm.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eFosstodon \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eHachyderm \n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eSo far Hachyderm seems to have more activity with Operations related hashtags.\nOn the other hand it could be that people on Hachyderm are generally more talkative than Fosstodon about every part of the stack.\nSo let\u0026rsquo;s hold development as the control.\u003c/p\u003e\n\u003cp\u003eOn the development queries we have \u003ccode\u003e49\u003c/code\u003e results from Fosstodon and \u003ccode\u003e24\u003c/code\u003e results from Hachyderm.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eFosstodon \n\u003c/span\u003e\u003c/span\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eHachyderm \n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eThat seems like an staggering differece.\u003csup id=\"fnref:1\"\u003e\u003ca href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\"\u003e1\u003c/a\u003e\u003c/sup\u003e\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eI have no idea why this difference is so harsh. But for my purposes I have enough information to update my beliefs to make a decision for now that satisfies my accuracy-requirements for this decision.\u003c/p\u003e\n\u003cdiv class=\"footnotes\" role=\"doc-endnotes\"\u003e\n\u003chr\u003e\n\u003col\u003e\n\u003cli id=\"fn:1\"\u003e\n\u003cp\u003eStaggering differences are often a sign of a weak research. So take this part with a grain of salt.\u0026#160;\u003ca href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\"\u003e\u0026#x21a9;\u0026#xfe0e;\u003c/a\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n",
            "date_published": "2022-11-25T22:17:00+03:30"
        }, {
            "title": "Power Structure of Social Networks",
            "id": "https://prma.dev/posts/power-structure-of-social-networks/",
            "url": "https://prma.dev/posts/power-structure-of-social-networks/",
            "summary": "Intro Why do some nations fail and rise so quickly? The answer to this questions has a surprisingly relevant answer to the recent migrations from a Twitter to Mastodon.\nPower Centrality Basically the idea is that:\nIn any system of governance the authority is constrained to the resources it has available. And for the authority to make a change, it has to answer to the resource providers. Given a set interdependent institutions one could form check-and-balance system.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eWhy do some nations fail and rise so quickly?\nThe answer to this questions has a surprisingly relevant answer to the recent migrations from a Twitter to Mastodon.\u003c/p\u003e\n\u003ch2 id=\"power-centrality\"\u003ePower Centrality\u003c/h2\u003e\n\u003cp\u003eBasically the idea is that:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eIn any system of governance the authority is constrained to the resources it has available.\u003c/li\u003e\n\u003cli\u003eAnd for the authority to make a change, it has to answer to the resource providers.\u003c/li\u003e\n\u003cli\u003eGiven a set interdependent institutions one could form check-and-balance system.\u003c/li\u003e\n\u003cli\u003eIf the dependence is not formed in a way that is biased towards zero-sum relationships the authority thrives.\u003c/li\u003e\n\u003cli\u003eFor the society to thrive it should be considered an institution on it\u0026rsquo;s own.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eLet\u0026rsquo;s make a few different forms of government considering the rule\u0026rsquo;s I just discussed.\u003c/p\u003e\n\u003cdiv class=\"note\"\u003e\n\u003cp\u003eAs dependence on involvement of people only comes when governments want more power and cannot retain the resources necessary from the land, High Natural-Resources and High People-involvement tend to be mutually.\u003c/p\u003e\n\u003c/div\u003e\n\u003ch2 id=\"high-centrality-high-natural-resources-low-people-involvement\"\u003eHigh Centrality, High Natural-Resources, Low People-involvement\u003c/h2\u003e\n\u003cp\u003eLet\u0026rsquo;s imagine a dictatorship on a land with rich natural resources. Dictatorship is an strongly centralized form of government. As such, the dictator does not have any dependencies. You might think that the government does need its people. But most of the time, such dictatorship has all that it needs from the naturally available resources.\u003c/p\u003e\n\u003cp\u003eThe dictator does not have to answer to anyone, and they have all the means necessary to make rapid changes, good or bad. The whole of the nation rise and fall quickly. The civic progression does not accumulate in time and only will be there while the dictator let it to be.\u003c/p\u003e\n\u003cp\u003eThe government does not need people uniting, form a danger to the government. Such authorities are highly motivated to bring social conflict, such as racism. Which may even lead to genocide by members of the society.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: Middle-east with it\u0026#39;s rich natural oil.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"high-centrality-low-natural-resources-low-people-involvement\"\u003eHigh Centrality, Low Natural-Resources, Low People-involvement\u003c/h2\u003e\n\u003cp\u003eNow, let\u0026rsquo;s imagine a dictatorship on a land with no natural resources, and no inclination to involve people.\u003c/p\u003e\n\u003cp\u003eSuch a nation will not flourish. The dictator is extremely constrained in its power.\u003c/p\u003e\n\u003cp\u003eIt has no validity among its people. As such it is unsuccessful in enforcing any law, good or bad. Such a nation sees lots and lots of \u003cem\u003ecoup d\u0026rsquo;tats\u003c/em\u003e. The authority is more alike a warlord.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: Central African nations.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"high-centrality-low-natural-resources-high-people-involvement\"\u003eHigh centrality, Low Natural-Resources, High People-involvement\u003c/h2\u003e\n\u003cp\u003eSuch a dictatorship, is a highly populist government. The dictator threats people as the main form of resource. Such nations can rise quickly. But before too long, the authority will figure out that he only needs society\u0026rsquo;s approval, but not its growth. And if you need approval, there is no quicker and better way than a common enemy. As such, such nations become too hostile to other nations. And may end-up using genocide as a means of keeping the country united.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: Germany during the Hitler era.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"low-centrality-high-natural-resources-low-people-involvement\"\u003eLow Centrality, High Natural-Resources, Low People-involvement\u003c/h2\u003e\n\u003cp\u003eSuch a nation looks great from the outside, but inside? It is polarized to say the least. These nations, just like any other nation with Low-Centrality is stable. The is formed by a group of institutions which keep each other in check. But alas, what good is it, if it is not for people?\u003c/p\u003e\n\u003cp\u003eSuch governments end up becoming extremely rich. But because people are not required for the government to perform, most of what the government is doing is providing value for the few that can provide them the resources they need.\u003c/p\u003e\n\u003cp\u003eSuch governments nations are subject to low progression in the civic laws, are extremely hard to change, and form strong bonds with few entities. As people are seen as a barrier, government\u0026rsquo;s like this tend to have a lot of controversial and theatrical surfaces, but end-up deciding things behind closed doors.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: USA during recent years, as it managed to put a huge people\u0026#39;s involvement.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"low-centrality-low-natural-resources-low-people-involvement\"\u003eLow Centrality, Low Natural-Resources, Low People-involvement\u003c/h2\u003e\n\u003cp\u003eThese governments are stable, but irrelevant. They fail to bring order, or protection for their people. And they don\u0026rsquo;t provide any infrastructural benefits the society.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: Afghanistan Right after USA army left it.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"low-centrality-low-natural-resources-high-people-involvement\"\u003eLow Centrality, Low Natural-Resources, High People-involvement\u003c/h2\u003e\n\u003cp\u003eThis, at least for now, seems to be some what the better of them all, but with some caveats. These governments are highly stable, and highly motivated by providing value to the people. They accumulate wealth and culture overtime. They are, also, resilient to hostile neighbours and bad actors. These societies tend to look good on the outside, but much better on the inside.\u003c/p\u003e\n\u003cp\u003eHowever, such governments are only weak to adapt to any radical changes, as the changes only happen when the people will it to happen. That means that these societies tend not to be the leaders or experimenters of different sorts of progress. However, they may end up reaching the top of the leader board in time.\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre tabindex=\"0\" style=\"background-color:#fff;-moz-tab-size:4;-o-tab-size:4;tab-size:4;\"\u003e\u003ccode class=\"language-text\" data-lang=\"text\"\u003e\u003cspan style=\"display:flex;\"\u003e\u003cspan\u003eThink of: Germany, today.\n\u003c/span\u003e\u003c/span\u003e\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003ch2 id=\"how-does-it-relate-to-the-twitter-and-fediverse-and-dot-dot-dot\"\u003eHow does it relate to the Twitter and Fediverse and \u0026hellip;?\u003c/h2\u003e\n\u003cp\u003eWell, there is a analogy to be made here.\u003c/p\u003e\n\u003cp\u003eWe can see the body(s) that runs, maintains, develop and moderate a social network as a form of a government. The users as the people and society.\nAnd the way that the proverbial social-network governments are being funded as the determining factor of people\u0026rsquo;s involvement in governance.\u003c/p\u003e\n\u003cp\u003eIn that regard we can think of Twitter, Facebook as highly concentrated. Considering that their power is immensely related to the number of users they have, we may be tempted to see them as somewhat of high in involvement of people.\nbut in actuality, people do not need to be actually participating in governing such a system. As they are the product, and the value comes from external means. That means that the users ended up being the natural resource of the land that is being sold for resources to the external actors.\u003c/p\u003e\n\u003cp\u003eAs such we end up with both exploitation of the users and their lack of ownership of their own data.\u003c/p\u003e\n\u003ch2 id=\"so-what-can-be-the-solution\"\u003eSo, what can be the solution?\u003c/h2\u003e\n\u003cp\u003eConsidering how unfortunate this situation is, there has always been a few different alternatives. Let\u0026rsquo;s just review them.\u003c/p\u003e\n\u003cp\u003eThere are systems that don\u0026rsquo;t count users as product, but as the customer. Such services, though small have a better record of listening to users.\u003c/p\u003e\n\u003cp\u003eHowever, as any centralized system, they are unstable, they remain small, and to keep users, they resort to vendor lock-ins. They also resort advertisement instead of increasing real value. Think of apple with its anti-advertisement campaigns against Microsoft.\u003c/p\u003e\n\u003cp\u003eAnother solution might be highly centralized systems without any sort of resources. These tend to be highly volatile and fast to disappear.\u003c/p\u003e\n\u003cp\u003eSo, decentralization might be the way to go.\u003c/p\u003e\n\u003cp\u003eAs low-centrality but highly-resourcefulness goes, I can only think of mailing groups. Mailing groups stand on the shoulders of mail providers.\u003c/p\u003e\n\u003cp\u003eDecentralized as mailing is, the ecosystem overwhelmingly is provided by a few company that their main products are again, people.\nAs discussed earlier, such systems tend to not have much progress. At least, not for the non-governing bodies. And indeed, that has been true.\nMailing and mailing groups is as user friendly and featureful as they have been 15 years ago.\u003c/p\u003e\n\u003cp\u003eWhich makes us resort to our last option. Low centrality and High involvement of people. Such a system has been the model for open-source development. Where the governance is highly motivated to help the people the same time as the people are highly motivated to help the governance.\nSuch a model has ended up being extended into forms of social governance. Where users fund their instances, help development and do volunteer moderations. And indeed, again, the parallel is not surprising: These systems tend not to have the greatest of the starts, but they end up enduring, and becoming more resilient.\u003c/p\u003e\n\u003cp\u003eMastodon, Pixelfed and other federated, open-sourced social networks, operate in such a model. And I like to think of people moving from Twitter to Mastodon as realizing that they matter and can should be more.\u003c/p\u003e\n\u003ch2 id=\"credit\"\u003eCredit\u003c/h2\u003e\n\u003cp\u003eThis work is highly inspired and heavily reliant on    \n\u0026rsquo;s fantastic book, \u003cem\u003eWhy Nations Fail\u003c/em\u003e. A must read.\u003c/p\u003e\n",
            "date_published": "2022-11-16T00:08:00+03:30"
        }
    ]
    
}
