
{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "perma on prma",
    "home_page_url": "https://prma.dev/tags/perma/",
    "feed_url": "https://prma.dev/tags/perma/feed.json",
    "items": [ {
            "title": "Call Me Perma",
            "id": "https://prma.dev/posts/call-me-perma/",
            "url": "https://prma.dev/posts/call-me-perma/",
            "summary": "I find myself seated in the passenger\u0026rsquo;s seat of my mother\u0026rsquo;s car, as we make our way to an appointment with an educational psychologist. A sense of confusion and concern lingers within me, stemming from my mother\u0026rsquo;s sudden and puzzling reaction to my C-graded report card. The journey passes quietly, and we arrive at the specialist\u0026rsquo;s office without exchanging a word, leaving me still uncertain about the purpose of our visit.",
            "content_html": "\u003cp\u003eI find myself seated in the passenger\u0026rsquo;s seat of my mother\u0026rsquo;s car, as we make our way to an appointment with an educational psychologist. A sense of confusion and concern lingers within me, stemming from my mother\u0026rsquo;s sudden and puzzling reaction to my C-graded report card. The journey passes quietly, and we arrive at the specialist\u0026rsquo;s office without exchanging a word, leaving me still uncertain about the purpose of our visit.\u003c/p\u003e\n\u003cp\u003eThe psychologist initiates our session by administering a series of aptitude and intelligence tests appropriate for my age. Throughout the process, my mother\u0026rsquo;s keen gaze remains fixed on me, intensifying my nerves. Eventually, the psychologist validates my mother\u0026rsquo;s suspicions, revealing that my intellectual capabilities far exceed those of my peers. This revelation prompts my mother to shed light on the purpose of our enigmatic expedition: \u003cq cite=\"my mother\"\u003e You see, you are not stupid, you are actually very smart, you just lack self-esteem!\u003c/q\u003e Was that truly the root of the issue? While self-esteem was a factor in my unhappniess, I couldn\u0026rsquo;t help but feel that my lack of effort had deeper origins.\u003c/p\u003e\n\u003cp\u003eOh, but this wasn\u0026rsquo;t the first round of this comical saga. You see, on previous occasions, my dear mother would strategically place a glass of water right between us, like a cosmic prop. And what was the grand purpose behind this visual spectacle, you might ask? Well, it was her way of nudging me into a philosophical monologue about that very glass. In simple terms: \u003cq cite=\"my mother\"\u003eHey, kiddo, you\u0026rsquo;ve got a shortage of optimism; you\u0026rsquo;re the sort who tends to spot the half-empty glass in life.\u003c/q\u003e\u003c/p\u003e\n\u003cp\u003eAnd then we have my dear old dad, the master of responsibility training. He had this grand plan to shape my character, using internships as his secret weapon. \u003cq cite=\"my father\"\u003eOff you go, my young apprentice!\u003c/q\u003e he\u0026rsquo;d exclaim, nudging me into one vocational adventure after another. His hidden message? \u003cq cite=\"my father\"\u003eKid, I\u0026rsquo;m passing down the sacred skill of handling responsibilities!\u003c/q\u003e Ah, the age-old dance of parental strategy.\u003c/p\u003e\n\u003cp\u003eAnd there you have it, my childhood summed up, right from the time those kindergarten teachers began their chorus of complaints about my apparent \u0026ldquo;refusal\u0026rdquo; to embrace the songs that my peers had effortlessly committed to memory months before.\u003c/p\u003e\n\u003cp\u003eAs the days went by, I began to adopt a personal mantra: \u003cq cite=\"me\"\u003eI\u0026rsquo;m the poster child for laziness, the embodiment of irresponsibility, with motivation and vision nowhere to be found.\u003c/q\u003e Oddly enough, despite knowing full well the significance of education and being genuinely captivated by the realms of science and math, my actions seemed to tell a different story altogether. It\u0026rsquo;s as if I was presenting evidence that contradicted my own beliefs. Perhaps deep down, I questioned my care for my parents, struggled to find motivation, or maybe I secretly aspired to master the art of freeloadery.\u003c/p\u003e\n\u003cp\u003eThe haze of doubt began to lift when I embarked on an \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cabbr title=\"Attention-Deficit/Hyperactivity Disorder\"\u003eADHD\u003c/abbr\u003e medication journey, and lo and behold, I experienced the novel sensation of being able to sit down and read a paragraph without my mind spiraling into chaos. It was like finally playing a video game where you no longer wonder if you\u0026rsquo;re in control of that character\u0026rsquo;s movements or not. My epiphany was quite the reverse: \u0026ldquo;Oh, wait a minute, I can indeed make decisions and stick with them?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLet me tell you, this realization was liberating, to put it mildly. Suddenly, I had the capacity to invest time in the very things that had ignited my curiosity.\u003c/p\u003e\n\u003cp\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cabbr title=\"Attention-Deficit/Hyperactivity Disorder\"\u003eADHD\u003c/abbr\u003e has had a profound impact on  my life since childhood. One revelation that became clear after seeking medication was the extent to which I had surrendered agency and intentionality.\u003c/p\u003e\n\u003cp\u003eMy existence had been defined by reactivity, with a noticeable absence of honed decision-making skills. I found myself in a state of passivity, or even worse, mere reactivity. Nonetheless, I consistently strived to reclaim it.\u003c/p\u003e\n\u003ch2 id=\"recent-victories\"\u003eRecent Victories\u003c/h2\u003e\n\u003cp\u003eOver the past few years, I\u0026rsquo;ve encountered an almost comically disproportionate share of misfortune and have found myself under substantial duress. Yet, I\u0026rsquo;ve navigated my way through these challenges.\u003c/p\u003e\n\u003cp\u003eI won\u0026rsquo;t delve into the specifics of these misfortunes, although those in my social circles can attest to their unusual frequency.\u003c/p\u003e\n\u003cp\u003eHowever, I can share that I\u0026rsquo;ve achieved several noteworthy milestones during this time span: acquiring programming skills, entering the workforce, entering marriage, and most recently, opting to unofficially change my name.\u003c/p\u003e\n\u003cp\u003eFormally, I remain \u003cspan class=\"person p-name\"\u003eAmirhossein\u003c/span\u003e, and I\u0026rsquo;m content should anyone choose to continue addressing me as such-I hold no animosity toward it. Nevertheless, it inadequately captures the depth of my identity.\u003c/p\u003e\n\u003ch2 id=\"bb76b9\"\u003e\u003cspan class=\"person p-name\"\u003eAmirhossein\u003c/span\u003e and \u003cspan class=\"person p-name\"\u003ePerma\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eThe name Amirhossein is a composite of two Arabic names, Amir and Hossein, both of which carry two meanings. As for the firsts of these meanings, Amir translates to \u0026ldquo;prince,\u0026rdquo; while Hossein signifies \u0026ldquo;Good-junior.\u0026rdquo; The amalgamation results in the interpretation of \u0026ldquo;Junior Good Prince.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHowever, I find myself at a loss when attempting to establish a personal connection with any aspect of this interpretation of this name. This brings us to its secondary and perhaps more intended connotation.\u003c/p\u003e\n\u003cp\u003eIn Shia Islam, there exists a concept akin to Christianity\u0026rsquo;s sainthood, known as \u0026ldquo;\u003cdfn\u003eImam\u003c/dfn\u003e\u0026rdquo;. However, these Imams are asserted to be leaders of the Islamic community. The first of these figures holds the title \u0026ldquo;\u003cspan class=\"person p-name\"\u003eAmir-al-momenin\u003c/span\u003e,\u0026rdquo; or the \u0026ldquo;prince of the faithful,\u0026rdquo; commonly abbreviated as Amir. The third Imam, the second son of the first, was named \u003cspan class=\"person p-name\"\u003eHossein\u003c/span\u003e. Both individuals deviate significantly from pacifism.\u003c/p\u003e\n\u003cp\u003eWhile these historical and linguistic connections hold merit, I must underscore a significant twist: since the age of 15, I have consciously disavowed Islam and theism in their entirety.\u003c/p\u003e\n\u003cp\u003eI find \u0026ldquo;\u003cspan class=\"person p-name\"\u003ePerma\u003c/span\u003e\u0026rdquo; to be a more fitting option, resonating more harmoniously with my ears. Moreover, it aligns with certain themes and passions that hold significance in my life. It closely aligns with the ethos underpinning this blog. I\u0026rsquo;m captivated by the philosophy of the \u003cem\u003ePermaCulture\u003c/em\u003e and \u003cem\u003ePermaComputing\u003c/em\u003e movements-albeit not necessarily their current implementations. My fascination lies in harmonizing with the world rather than coercing it to conform to my presence. Moreover, the notion of leaving a lasting imprint on the world holds a special allure for me. However, this yearning leans more toward the aesthetic realm rather than being rooted in \u003cem\u003eutilitarian\u003c/em\u003e aspirations.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eIf you\u0026rsquo;ve known me previously, you might have observed my recent shifts in usernames, emails, and name. Across the internet, I\u0026rsquo;ve opted for \u003ccode\u003ePrma\u003c/code\u003e instead of the more direct \u003ccode\u003ePerma\u003c/code\u003e, as the latter is frequently claimed or could serve other entities more fittingly.\u003c/p\u003e\n\u003cp\u003eHowever, this change isn\u0026rsquo;t indicative of a complete unveiling of my authentic self. Thus, referring to me by my previous name isn\u0026rsquo;t as insensitive as the act of deadnaming. Rather, this transition signifies the inception of a renewed chapter, one marked by heightened purpose and intention.\u003c/p\u003e\n\u003cp\u003eWhile I do prefer and hope for the usage of \u0026ldquo;\u003cspan class=\"person p-name\"\u003ePerma\u003c/span\u003e\u0026rdquo; moving forward, I\u0026rsquo;m entirely at ease if you choose otherwise. Your decision in this regard is genuinely respected.\u003c/p\u003e\n",
            "date_published": "2023-08-09T12:31:00+03:30"
        }
    ]
    
}
