
{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "Abouts on prma",
    "home_page_url": "https://prma.dev/about/",
    "feed_url": "https://prma.dev/about/feed.json",
    "authors": [{
        "name": {"email":"prma.dev@protonmail.com","name":"Perma"},
    }],
    "items": [ {
            "title": "ME",
            "id": "https://prma.dev/about/me/",
            "url": "https://prma.dev/about/me/",
            "summary": "In this vast world, teeming with approximately 8 billion human beings, I, too, find myself among their ranks, a singular entity in the tapestry of humanity.\nThrough my intellectual journey, I have delved into the realms of architecture and cognitive science, exploring the intricate connections between our built environment and the workings of the human mind. However, amidst this exploration, my fascination with computing remained unwavering, beckoning me towards a path where I finally discovered my true calling as a developer.",
            "content_html": "\u003cp\u003eIn this vast world, teeming with approximately 8 billion human beings, I, too, find myself among their ranks, a singular entity in the tapestry of humanity.\u003c/p\u003e\n\u003cp\u003eThrough my intellectual journey, I have delved into the realms of architecture and cognitive science, exploring the intricate connections between our built environment and the workings of the human mind. However, amidst this exploration, my fascination with computing remained unwavering, beckoning me towards a path where I finally discovered my true calling as a developer.\u003c/p\u003e\n\u003ch2 id=\"name-wise\"\u003eName-wise\u003c/h2\u003e\n\u003cp\u003eYou can call me \u003cspan class=\"person p-nickname\"\u003ePerma\u003c/span\u003e. My legal name is \u003cspan class=\"person p-name p-given-name\"\u003eAmirHossein Alesheikh\u003c/span\u003e. I don\u0026rsquo;t mind either, but I prefer \u003cspan class=\"person p-nickname\"\u003ePerma\u003c/span\u003e. Read \u003ca href=\"../../posts/call-me-perma\"\u003eCall Me Perma\u003c/a\u003e for more information.\u003c/p\u003e\n\u003cp\u003eYou can use any pronouns, I don\u0026rsquo;t mind any of them, I don\u0026rsquo;t identify with any of genders, anyways. But it will be nice if you could make it clear to me which one you have chosen.\u003c/p\u003e\n\u003ch2 id=\"job-wise\"\u003eJob-wise\u003c/h2\u003e\n\u003cp\u003eAs a back-end developer, my expertise lies in utilizing languages like \u003ca class=\"language\" href=\"https://go.dev/\"\u003eGo\u003c/a\u003e\n and \u003ca class=\"language\" href=\"https://www.rust-lang.org/\"\u003eRust\u003c/a\u003e\n to build the foundational components of software systems.\u003c/p\u003e\n\u003cp\u003eI predominantly focus on developing the back-end of back-ends, ensuring the smooth functioning and interconnectivity of various subsystems.\u003c/p\u003e\n\u003cp\u003eAdditionally, I also engage in system programming, working with low-level components and infrastructure to ensure optimal performance and reliability.\u003c/p\u003e\n\u003ch2 id=\"tech-wise\"\u003eTech-wise\u003c/h2\u003e\n\u003cp\u003eSince the tender age of 5, my eyes have been fixated on computer screens, even during those moments when they lay dormant. The hours I\u0026rsquo;ve devoted to sitting behind desktop computers far exceed the time I\u0026rsquo;ve dedicated to restful slumber. Throughout my life, I proudly embrace the label of a \u003cem\u003ebona fide\u003c/em\u003e textbook nerd, finding immense joy and fascination in the pages of educational literature. In fact, my favorite genre of books happens to be none other than textbooks themselves.\u003c/p\u003e\n\u003ch2 id=\"advocacy\"\u003eAdvocacy\u003c/h2\u003e\n\u003cp\u003eFor over 15 years, I have actively engaged in the realm of free software advocacy, passionately advocating for the principles of openness and accessibility. It\u0026rsquo;s safe to say that I find myself firmly planted in the far-left corner of political stereotypes, unapologetically embracing a feminist perspective, advocating for veganism and animal rights, and actively participating in environmentalism. While there are other aspects of my beliefs, such as my alignment with \u003ca href=\"https://www.lesswrong.com/tag/rationalist-movement\"\u003erationalism\u003c/a\u003e, utilitarianism, and consciousness idealism, I won\u0026rsquo;t delve into those topics and burden you with excessive details.\u003c/p\u003e\n\u003ch2 id=\"me-in-the-wild\"\u003eMe, in the wild\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https:fosstodon.org/@prma\"\u003eFosstodon\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https:codeberg.org/prma\"\u003eCodeberg\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https:github.com/prmadev\"\u003eGitHub\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https:linkedin.com/in/prmadev\"\u003eLinkedin\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"faq\"\u003eFAQ\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWhat time is it?\u003c/li\u003e\n\u003cli\u003eWhat\u0026rsquo;s your dogs name?\u003c/li\u003e\n\u003cli\u003eIs your dog friendly?\u003c/li\u003e\n\u003cli\u003eIs it your turn to cook lunch or mine?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYeah, I hear these questions quit frequently!\u003c/p\u003e\n",
            "date_published": "2023-10-09T16:43:00+03:30"
        }
    ]
    
}
