
{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "tools on prma",
    "home_page_url": "https://prma.dev/tags/tools/",
    "feed_url": "https://prma.dev/tags/tools/feed.json",
    "authors": [{
        "name": {"email":"prma.dev@protonmail.com","name":"Perma"},
    }],
    "items": [ {
            "title": "Criteria For Choosing Tools",
            "id": "https://prma.dev/posts/criteria-for-choosing-tools/",
            "url": "https://prma.dev/posts/criteria-for-choosing-tools/",
            "summary": "Intro The web is utterly fucked. But anyone with some resources resources at hand and curiosity at heart and intentional tool selection can have a decent experience.\nThe Reasons The web\u0026rsquo;s lamentable state can be attributed to several factors. Allow me to enumerate them concisely for clarity:\nBloated beyond reason. Plagued with incessant ads. Prioritizing feature over bug fixes, if addressed at all. Designed to cater to journalists and advertisers, neglecting your needs.",
            "content_html": "\u003ch2 id=\"intro\"\u003eIntro\u003c/h2\u003e\n\u003cp\u003eThe web is utterly fucked. But anyone with some resources resources at hand and curiosity at heart and intentional tool selection can have a decent experience.\u003c/p\u003e\n\u003ch2 id=\"the-reasons\"\u003eThe Reasons\u003c/h2\u003e\n\u003cp\u003eThe web\u0026rsquo;s lamentable state can be attributed to several factors. Allow me to enumerate them concisely for clarity:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBloated beyond reason.\u003c/li\u003e\n\u003cli\u003ePlagued with incessant ads.\u003c/li\u003e\n\u003cli\u003ePrioritizing feature over bug fixes, if addressed at all.\u003c/li\u003e\n\u003cli\u003eDesigned to cater to journalists and advertisers, neglecting your needs.\u003c/li\u003e\n\u003cli\u003eImposing confinement and isolation upon you.\u003c/li\u003e\n\u003cli\u003eFailing to empower users like yourself.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3 id=\"a-brief-digression\"\u003eA Brief Digression\u003c/h3\u003e\n\u003cp\u003eThe final point warrants further elaboration.\u003c/p\u003e\n\u003cp\u003eThe internet is, in fact, a tool. It is \u003cem\u003esomething\u003c/em\u003e that is made to help \u003cem\u003esomeone\u003c/em\u003e achieve \u003cem\u003esome goal\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThe captivating world of \u003cem\u003eWeb 2.0\u003c/em\u003e and \u003cem\u003eSocial Media\u003c/em\u003e (the somethings) - initially promising to empower people (the someones), granting them enriched social connections (the some goal). A promising start, indeed, leaving many with pleasant experiences during the inception of Web 2.0.\u003c/p\u003e\n\u003cp\u003eBut, alas, as time went by, the very incentives that drove these Social Media companies veered them off their intended course. They embarked on a divergent path, straying from their professed mission, and now, Web 2.0 primarily serves as a platform to amplify the voices of journalists and celebrities (the actual someones), propelling them towards greater fame and recognition (the actual some goals).\u003c/p\u003e\n\u003cp\u003eThe driving force behind these shifts? The ever-persistent quest for revenue from advertisers, pushing them to create content that captures maximum engagement. The more captivating, the more lucrative.\u003c/p\u003e\n\u003cp\u003eRegrettably, the landscape has birthed what I would call the \u0026ldquo;four horsemen of reactionary engagement\u0026rdquo;: the doomsday, super political reporter; the enraging, populist racist politician; the trolling, impulsive \u003cabbr title=\"Chief Executive Officer\"\u003eCEO\u003c/abbr\u003e\n; and the drama-driven, vacuous celebrity.\u003c/p\u003e\n\u003cp\u003eIn a nutshell, it appears you\u0026rsquo;ve been played for a fool. Social media\u0026rsquo;s purported aim of empowering you is nothing but a delusion.\u003c/p\u003e\n\u003ch2 id=\"go-empower-yourself\"\u003eGo Empower yourself\u003c/h2\u003e\n\u003cp\u003eBefore you proceed, there\u0026rsquo;s a prerequisite to address: overcoming the fear of missing out. Now, how one achieves this is not within my scope to divulge, but I can assist you in understanding why these fears are unfounded.\u003c/p\u003e\n\u003cp\u003eConsider this: Have you truly missed out on anything of genuine importance? Reflect on whether the latest controversial statement from Donald Trump has genuinely altered the course of your life. And if it did, was Twitter (or whatever they dub it these days) truly the sole or optimal medium for receiving such information?\u003c/p\u003e\n\u003cp\u003eEven in Iran, where official channels are notorious for propagating falsehoods, Twitter appears to be excessive. For me, friends and private messages reliably convey essential information. And indeed, individuals might spend considerable time on Twitter, but isn\u0026rsquo;t the fundamental pledge of social media the relay of information? If that need is already being fulfilled through other means, what purpose does Twitter truly serve?\u003c/p\u003e\n\u003cp\u003eIf you find yourself fortunate enough to reside in a country with trustworthy official channels, and your well-being hinges on crucial information like hurricane alerts, rest assured that dedicated services cater specifically to such needs. Similarly, if you derive pleasure from reading news articles, I suggest identifying the authors whose work you value and following them directly. However, if these activities do not align with your interests, then quite frankly, you have no real necessity for engaging with this \u0026ldquo;stuff.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eOh, my friend, let me share with you a sobering truth about these companies - they\u0026rsquo;re akin to emotionally abusive partners, manipulating you into believing you\u0026rsquo;re nothing without them. They demean you, calling you stupid and incapable of managing your life without their presence. They cunningly weave a narrative of how your life is all thanks to them, that your friendships exist solely because of their benevolence.\u003c/p\u003e\n\u003cp\u003eBut don\u0026rsquo;t be fooled by their deceiving ways. They mangle your interactions, force-feeding you ads and utter nonsense, all while claiming it\u0026rsquo;s an act of love. And when their misdeeds come to light, they stage a grand spectacle of apologies and vows to change, only to strike back even harder later on.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s time to break free from this toxic cycle. I know it\u0026rsquo;s daunting, and fear may grip your heart initially, but liberate yourself from their clutches. You will discover a life far better than you ever imagined. You deserve more than this relentless manipulation. Embrace the freedom that awaits, my dear friend.\u003c/p\u003e\n\u003ch2 id=\"how-to-find-a-good-tool\"\u003eHow to find a good tool\u003c/h2\u003e\n\u003ch3 id=\"step-one-find-the-low-hanging-fruits\"\u003eStep One: Find The Low Hanging Fruits\u003c/h3\u003e\n\u003cp\u003eYou stand at the precipice of transformation, ready to change your life for the better. The first step is to identify the areas in your life that require attention. What needs are you seeking to fulfill? And upon which inadequate services are you currently relying?\u003c/p\u003e\n\u003cp\u003eIn my case, I sought:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eA steady flow of lightweight information.\u003c/li\u003e\n\u003cli\u003eDaily interactions with fellow enthusiasts akin to myself.\u003c/li\u003e\n\u003cli\u003eA means to uncover specific data.\u003c/li\u003e\n\u003cli\u003eA reliable way to send emails.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eFor too long, I depended on subpar sources to meet these needs. For the first two, I found myself reliant on Twitter, Instagram, Reddit, and Google News. As for the third and fourth requirements, I resorted to Google\u0026rsquo;s services. However, all of these platforms consistently fell short and inflicted undue stress upon me.\u003c/p\u003e\n\u003ch3 id=\"step-two-find-effective-replacements\"\u003eStep Two: Find Effective Replacements\u003c/h3\u003e\n\u003cp\u003eIn my earlier post I have mentioned that I already have replaced most of these services with better ones. But I have not mentioned what constitutes an effective solution.\u003c/p\u003e\n\u003cp\u003eIn \u003ca href=\"../web-experience-makeover\"\u003emy previous post\u003c/a\u003e, I alluded to having replaced many of these services with superior alternatives. However, I haven\u0026rsquo;t delved into what exactly makes a solution effective.\u003c/p\u003e\n\u003cp\u003eAllow me to outline the criteria and guiding principles for an empowering tool:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eIt should not cause you any harm.\u003c/li\u003e\n\u003cli\u003eIt should not lock you in.\u003c/li\u003e\n\u003cli\u003eIt should not feel frugal.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eNow, let me delve into the rationale behind these criteria:\u003c/p\u003e\n\u003ch4 id=\"1-dot-it-should-not-cause-you-more-harm-than-good\"\u003e1. It should not cause you more harm than good\u003c/h4\u003e\n\u003cp\u003eIf a tool causes more harm than good, why persist in using it at all?\u003c/p\u003e\n\u003cp\u003eTo safeguard your interests, ensure that the tool operates with transparency. Platforms that intentionally harm users are less inclined to be forthcoming about their inner workings. Opt for open-source and audited software, provided you trust the incentives and capabilities of the auditors, as this fosters transparency.\u003c/p\u003e\n\u003cp\u003eMoreover, it is crucial to align the incentives of the tool\u0026rsquo;s creators with your own. While there will always be some degree of misalignment, not all cases are equal. Selling or renting software may incentivize developers to plan for obsolescence, sell incomplete products, or enforce lock-ins. Yet, these misalignments are overshadowed by the egregious discrepancies inherent in ad-driven models.\u003c/p\u003e\n\u003ch4 id=\"2-dot-it-should-not-lock-you-in\"\u003e2. It should not lock you in\u003c/h4\u003e\n\u003cp\u003eIndeed, the peril of being locked into a tool becomes evident when the company\u0026rsquo;s incentives undergo a shift. I experienced this firsthand in 2015 when I was a loyal Evernote user with a premium subscription, trusting it with all my valuable information. However, when Evernote decided to drop right-to-left language support crucial for the Middle Eastern languages, my pleas for assistance fell on deaf ears. They deemed the region unworthy of attention, leaving me stranded and unable to utilize my data effectively.\u003c/p\u003e\n\u003cp\u003eThe true pain emerged when I attempted to export my information and realized I was trapped in their ecosystem. They held my notes hostage, providing them back only in a non-standard format through XML or JSON files. This, my friends, was the dreaded lock-in, and I had to endure a labyrinthine journey of manual extraction to break free.\u003c/p\u003e\n\u003cp\u003eTo avoid such a predicament, one essential question should be posed:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eWill it be more difficult for me to switch to a competitor once I\u0026rsquo;ve fully adopted this service compared to my current situation before using it?\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eIf the service retains your data and only offers it back in a non-standard format, it becomes significantly more challenging to transition to a competitor after investing your notes into the first service. Be vigilant and consider the implications before getting entangled in such situations.\u003c/p\u003e\n\u003ch4 id=\"3-dot-it-should-not-feel-frugal-dot\"\u003e3. It should not feel frugal.\u003c/h4\u003e\n\u003cp\u003eLet us keep in mind the essence of this endeavor: to enhance the quality of our lives. Undoubtedly, there are noble causes that may necessitate adopting a certain level of frugality, as was the case for me with animal rights, which amusingly led me to embrace veganism.\u003c/p\u003e\n\u003cp\u003eHowever, advocating for these causes demands energy, and it might inadvertently lead to isolation. We must acknowledge that not everything can or should be a constant battle. The purpose of utilizing these tools is to improve our lives, not to make them more arduous.\u003c/p\u003e\n\u003cp\u003eIf safeguarding your privacy to the utmost extreme is your goal, then by all means, employ complex passwords for each site and commit them to memory. Nevertheless, we must be mindful that our fighting energy is finite. Thus, it becomes essential to prioritize and channel our limited energy toward the most urgent and meaningful issues that truly resonate with our hearts.\u003c/p\u003e\n\u003ch2 id=\"dear-reader\"\u003eDear Reader\u003c/h2\u003e\n\u003cp\u003eYou are on the right path, and I believe in you wholeheartedly! Trust me, I\u0026rsquo;ve been through this journey myself, and it turned out to be a delightful and straightforward experience. Take heart, for you can certainly achieve it too! Keep going, and you\u0026rsquo;ll soon realize how much better and easier life becomes. You\u0026rsquo;ve got this!\u003c/p\u003e\n",
            "date_published": "2023-07-29T12:14:00+03:30"
        }
    ]
    
}
